/* automatically generated by rust-bindgen 0.72.1 */
/* Pre-generated bindings for docs.rs builds (no network access).
   These bindings were generated from SCIP headers and are used
   when building documentation on docs.rs. */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };

pub const NLOCKTYPES: u32 = 2;
pub const SCIP_DIVETYPE_NONE: u32 = 0;
pub const SCIP_DIVETYPE_INTEGRALITY: u32 = 1;
pub const SCIP_DIVETYPE_SOS1VARIABLE: u32 = 2;
pub const SCIP_HEURDISPCHAR_LNS: u8 = 76u8;
pub const SCIP_HEURDISPCHAR_DIVING: u8 = 100u8;
pub const SCIP_HEURDISPCHAR_ITERATIVE: u8 = 105u8;
pub const SCIP_HEURDISPCHAR_OBJDIVING: u8 = 111u8;
pub const SCIP_HEURDISPCHAR_PROP: u8 = 112u8;
pub const SCIP_HEURDISPCHAR_ROUNDING: u8 = 114u8;
pub const SCIP_HEURDISPCHAR_TRIVIAL: u8 = 116u8;
pub const SCIP_EXPR_MAXINITESTIMATES: u32 = 10;
pub const SCIP_EXPRITER_MAXNACTIVE: u32 = 5;
pub const SCIP_EXPRITER_ENTEREXPR: u32 = 1;
pub const SCIP_EXPRITER_VISITINGCHILD: u32 = 2;
pub const SCIP_EXPRITER_VISITEDCHILD: u32 = 4;
pub const SCIP_EXPRITER_LEAVEEXPR: u32 = 8;
pub const SCIP_EXPRITER_ALLSTAGES: u32 = 15;
pub const SCIP_EXPRPRINT_EXPRSTRING: u32 = 1;
pub const SCIP_EXPRPRINT_EXPRHDLR: u32 = 2;
pub const SCIP_EXPRPRINT_NUSES: u32 = 4;
pub const SCIP_EXPRPRINT_EVALVALUE: u32 = 8;
pub const SCIP_EXPRPRINT_EVALTAG: u32 = 24;
pub const SCIP_EXPRPRINT_ACTIVITY: u32 = 32;
pub const SCIP_EXPRPRINT_ACTIVITYTAG: u32 = 96;
pub const SCIP_EXPRPRINT_OWNER: u32 = 128;
pub const SCIP_EXPRPRINT_ALL: u32 = 255;
pub const SCIP_NLPPARAM_DEFAULT_VERBLEVEL: u32 = 0;
pub const SCIP_DECOMP_LINKVAR: i32 = -1;
pub const SCIP_DECOMP_LINKCONS: i32 = -2;
pub const __HAS_FIXED_CHK_PROTOTYPES: u32 = 1;
pub const QUAD_EPSILON: f64 = 0.000000000001;
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const SCIP_NLHDLR_METHOD_NONE: u32 = 0;
pub const SCIP_NLHDLR_METHOD_SEPABELOW: u32 = 1;
pub const SCIP_NLHDLR_METHOD_SEPAABOVE: u32 = 2;
pub const SCIP_NLHDLR_METHOD_SEPABOTH: u32 = 3;
pub const SCIP_NLHDLR_METHOD_ACTIVITY: u32 = 4;
pub const SCIP_NLHDLR_METHOD_ALL: u32 = 7;
pub const SCIP_MAXVERTEXPOLYDIM: u32 = 14;
pub const SYM_TIMING_BEFOREPRESOL: u32 = 0;
pub const SYM_TIMING_DURINGPRESOL: u32 = 1;
pub const SYM_TIMING_AFTERPRESOL: u32 = 2;
pub const SYM_COMPUTETIMING_BEFOREPRESOL: u32 = 0;
pub const SYM_COMPUTETIMING_DURINGPRESOL: u32 = 1;
pub const SYM_COMPUTETIMING_AFTERPRESOL: u32 = 2;
pub const ARTIFICIALVARNAMEPREFIX: &[u8; 14] = b"andresultant_\0";
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"]
        [::std::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"]
        [::std::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::std::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::std::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::std::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::std::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"]
        [::std::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"]
        [::std::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"]
        [::std::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"]
        [::std::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::std::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::std::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type va_list = __darwin_va_list;
unsafe extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renamex_np(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn renameatx_np(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::std::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
unsafe extern "C" {
    pub static mut __stdinp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stderrp: *mut FILE;
}
unsafe extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_int,
        arg2: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn gets(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __svfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __swbuf(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __prefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type off_t = __darwin_off_t;
unsafe extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __offset: off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
unsafe extern "C" {
    pub fn snprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(
        __str: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        arg1: __builtin_va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getline(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut usize,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn fmemopen(
        __buf: *mut ::std::os::raw::c_void,
        __size: usize,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(
        __bufp: *mut *mut ::std::os::raw::c_char,
        __sizep: *mut usize,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub static sys_nerr: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
unsafe extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ctermid_r(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fgetln(arg1: *mut FILE, __len: *mut usize) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fmtcheck(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn funopen(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_char,
                __n: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: fpos_t,
                arg3: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: va_list,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        arg2: ::std::os::raw::c_int,
        arg3: usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: va_list,
    ) -> ::std::os::raw::c_int;
}
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type float_t = f32;
pub type double_t = f64;
unsafe extern "C" {
    pub fn __math_errhandling() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyf(arg1: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyd(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __fpclassifyl(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn acosf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn acos(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acosl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn asin(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2f(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn atan2(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn atan2l(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cos(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn cosl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sin(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tan(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn acosh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn acoshl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn asinh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn asinhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn atanh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn atanhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn coshf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cosh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn coshl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sinh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sinhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanhf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tanh(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tanhl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn exp2(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn exp2l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn expm1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn expm1l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log10(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log10l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log2(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log2l(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1pf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn log1p(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn log1pl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logbf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn logb(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn logbl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn modff(arg1: f32, arg2: *mut f32) -> f32;
}
unsafe extern "C" {
    pub fn modf(arg1: f64, arg2: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn modfl(arg1: f64, arg2: *mut f64) -> f64;
}
unsafe extern "C" {
    pub fn ldexpf(arg1: f32, arg2: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn ldexp(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ldexpl(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn frexpf(arg1: f32, arg2: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn frexp(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn frexpl(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn ilogbf(arg1: f32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ilogb(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ilogbl(arg1: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn scalbnf(arg1: f32, arg2: ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn scalbn(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn scalbnl(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn scalblnf(arg1: f32, arg2: ::std::os::raw::c_long) -> f32;
}
unsafe extern "C" {
    pub fn scalbln(arg1: f64, arg2: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn scalblnl(arg1: f64, arg2: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn fabsf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn fabs(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn fabsl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrtf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn cbrt(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn cbrtl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypotf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn hypot(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn hypotl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn powf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn pow(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn powl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrtf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn sqrt(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn sqrtl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn erfcl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lgammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn tgammal(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceilf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn ceil(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn ceill(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn floorf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn floor(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn floorl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn nearbyintf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn nearbyint(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn nearbyintl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn rintf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn rint(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn rintl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lrintf(arg1: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lrint(arg1: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lrintl(arg1: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn roundf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn round(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn roundl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn lroundf(arg1: f32) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lround(arg1: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn lroundl(arg1: f64) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llrintf(arg1: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llrint(arg1: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llrintl(arg1: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llroundf(arg1: f32) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llround(arg1: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn llroundl(arg1: f64) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn truncf(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn trunc(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn truncl(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmodf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmod(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmodl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainderf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn remainder(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn remainderl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn remquof(arg1: f32, arg2: f32, arg3: *mut ::std::os::raw::c_int) -> f32;
}
unsafe extern "C" {
    pub fn remquo(arg1: f64, arg2: f64, arg3: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn remquol(arg1: f64, arg2: f64, arg3: *mut ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    pub fn copysignf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn copysign(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn copysignl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nanf(arg1: *const ::std::os::raw::c_char) -> f32;
}
unsafe extern "C" {
    pub fn nan(arg1: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn nanl(arg1: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn nextafterf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn nextafter(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nextafterl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttoward(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn nexttowardf(arg1: f32, arg2: f64) -> f32;
}
unsafe extern "C" {
    pub fn nexttowardl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fdimf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fdim(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fdiml(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaxf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmax(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaxl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fminf(arg1: f32, arg2: f32) -> f32;
}
unsafe extern "C" {
    pub fn fmin(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fminl(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmaf(arg1: f32, arg2: f32, arg3: f32) -> f32;
}
unsafe extern "C" {
    pub fn fma(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
unsafe extern "C" {
    pub fn fmal(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
unsafe extern "C" {
    pub fn __exp10f(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __exp10(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __cospif(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __cospi(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __sinpif(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __sinpi(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __tanpif(arg1: f32) -> f32;
}
unsafe extern "C" {
    pub fn __tanpi(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn __fabsf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __hypotf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __sqrtf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __ceilf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __floorf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __rintf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __roundf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __truncf16(arg1: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __copysignf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __nextafterf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __fmaxf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __fminf16(arg1: __BindgenFloat16, arg2: __BindgenFloat16) -> __BindgenFloat16;
}
unsafe extern "C" {
    pub fn __fmaf16(
        arg1: __BindgenFloat16,
        arg2: __BindgenFloat16,
        arg3: __BindgenFloat16,
    ) -> __BindgenFloat16;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __float2 {
    pub __sinval: f32,
    pub __cosval: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __float2"][::std::mem::size_of::<__float2>() - 8usize];
    ["Alignment of __float2"][::std::mem::align_of::<__float2>() - 4usize];
    ["Offset of field: __float2::__sinval"][::std::mem::offset_of!(__float2, __sinval) - 0usize];
    ["Offset of field: __float2::__cosval"][::std::mem::offset_of!(__float2, __cosval) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __double2 {
    pub __sinval: f64,
    pub __cosval: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __double2"][::std::mem::size_of::<__double2>() - 16usize];
    ["Alignment of __double2"][::std::mem::align_of::<__double2>() - 8usize];
    ["Offset of field: __double2::__sinval"][::std::mem::offset_of!(__double2, __sinval) - 0usize];
    ["Offset of field: __double2::__cosval"][::std::mem::offset_of!(__double2, __cosval) - 8usize];
};
unsafe extern "C" {
    pub fn __sincosf_stret(arg1: f32) -> __float2;
}
unsafe extern "C" {
    pub fn __sincos_stret(arg1: f64) -> __double2;
}
unsafe extern "C" {
    pub fn __sincospif_stret(arg1: f32) -> __float2;
}
unsafe extern "C" {
    pub fn __sincospi_stret(arg1: f64) -> __double2;
}
unsafe extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
unsafe extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub fn scalb(arg1: f64, arg2: f64) -> f64;
}
unsafe extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct exception {
    pub type_: ::std::os::raw::c_int,
    pub name: *mut ::std::os::raw::c_char,
    pub arg1: f64,
    pub arg2: f64,
    pub retval: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of exception"][::std::mem::size_of::<exception>() - 40usize];
    ["Alignment of exception"][::std::mem::align_of::<exception>() - 8usize];
    ["Offset of field: exception::type_"][::std::mem::offset_of!(exception, type_) - 0usize];
    ["Offset of field: exception::name"][::std::mem::offset_of!(exception, name) - 8usize];
    ["Offset of field: exception::arg1"][::std::mem::offset_of!(exception, arg1) - 16usize];
    ["Offset of field: exception::arg2"][::std::mem::offset_of!(exception, arg2) - 24usize];
    ["Offset of field: exception::retval"][::std::mem::offset_of!(exception, retval) - 32usize];
};
unsafe extern "C" {
    pub fn __assert_rtn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> !;
}
pub const idtype_t_P_ALL: idtype_t = 0;
pub const idtype_t_P_PID: idtype_t = 1;
pub const idtype_t_P_PGID: idtype_t = 2;
pub type idtype_t = ::std::os::raw::c_uint;
pub type pid_t = __darwin_pid_t;
pub type id_t = __darwin_id_t;
pub type sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state {
    pub __exception: __uint32_t,
    pub __fsr: __uint32_t,
    pub __far: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state"]
        [::std::mem::size_of::<__darwin_arm_exception_state>() - 12usize];
    ["Alignment of __darwin_arm_exception_state"]
        [::std::mem::align_of::<__darwin_arm_exception_state>() - 4usize];
    ["Offset of field: __darwin_arm_exception_state::__exception"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __exception) - 0usize];
    ["Offset of field: __darwin_arm_exception_state::__fsr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __fsr) - 4usize];
    ["Offset of field: __darwin_arm_exception_state::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state, __far) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state64 {
    pub __far: __uint64_t,
    pub __esr: __uint32_t,
    pub __exception: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state64"]
        [::std::mem::size_of::<__darwin_arm_exception_state64>() - 16usize];
    ["Alignment of __darwin_arm_exception_state64"]
        [::std::mem::align_of::<__darwin_arm_exception_state64>() - 8usize];
    ["Offset of field: __darwin_arm_exception_state64::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __far) - 0usize];
    ["Offset of field: __darwin_arm_exception_state64::__esr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __esr) - 8usize];
    ["Offset of field: __darwin_arm_exception_state64::__exception"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64, __exception) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_exception_state64_v2 {
    pub __far: __uint64_t,
    pub __esr: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_exception_state64_v2"]
        [::std::mem::size_of::<__darwin_arm_exception_state64_v2>() - 16usize];
    ["Alignment of __darwin_arm_exception_state64_v2"]
        [::std::mem::align_of::<__darwin_arm_exception_state64_v2>() - 8usize];
    ["Offset of field: __darwin_arm_exception_state64_v2::__far"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64_v2, __far) - 0usize];
    ["Offset of field: __darwin_arm_exception_state64_v2::__esr"]
        [::std::mem::offset_of!(__darwin_arm_exception_state64_v2, __esr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_thread_state {
    pub __r: [__uint32_t; 13usize],
    pub __sp: __uint32_t,
    pub __lr: __uint32_t,
    pub __pc: __uint32_t,
    pub __cpsr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_thread_state"]
        [::std::mem::size_of::<__darwin_arm_thread_state>() - 68usize];
    ["Alignment of __darwin_arm_thread_state"]
        [::std::mem::align_of::<__darwin_arm_thread_state>() - 4usize];
    ["Offset of field: __darwin_arm_thread_state::__r"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __r) - 0usize];
    ["Offset of field: __darwin_arm_thread_state::__sp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __sp) - 52usize];
    ["Offset of field: __darwin_arm_thread_state::__lr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __lr) - 56usize];
    ["Offset of field: __darwin_arm_thread_state::__pc"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __pc) - 60usize];
    ["Offset of field: __darwin_arm_thread_state::__cpsr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state, __cpsr) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_thread_state64 {
    pub __x: [__uint64_t; 29usize],
    pub __fp: __uint64_t,
    pub __lr: __uint64_t,
    pub __sp: __uint64_t,
    pub __pc: __uint64_t,
    pub __cpsr: __uint32_t,
    pub __pad: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_thread_state64"]
        [::std::mem::size_of::<__darwin_arm_thread_state64>() - 272usize];
    ["Alignment of __darwin_arm_thread_state64"]
        [::std::mem::align_of::<__darwin_arm_thread_state64>() - 8usize];
    ["Offset of field: __darwin_arm_thread_state64::__x"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __x) - 0usize];
    ["Offset of field: __darwin_arm_thread_state64::__fp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __fp) - 232usize];
    ["Offset of field: __darwin_arm_thread_state64::__lr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __lr) - 240usize];
    ["Offset of field: __darwin_arm_thread_state64::__sp"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __sp) - 248usize];
    ["Offset of field: __darwin_arm_thread_state64::__pc"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __pc) - 256usize];
    ["Offset of field: __darwin_arm_thread_state64::__cpsr"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __cpsr) - 264usize];
    ["Offset of field: __darwin_arm_thread_state64::__pad"]
        [::std::mem::offset_of!(__darwin_arm_thread_state64, __pad) - 268usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_vfp_state {
    pub __r: [__uint32_t; 64usize],
    pub __fpscr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_vfp_state"][::std::mem::size_of::<__darwin_arm_vfp_state>() - 260usize];
    ["Alignment of __darwin_arm_vfp_state"]
        [::std::mem::align_of::<__darwin_arm_vfp_state>() - 4usize];
    ["Offset of field: __darwin_arm_vfp_state::__r"]
        [::std::mem::offset_of!(__darwin_arm_vfp_state, __r) - 0usize];
    ["Offset of field: __darwin_arm_vfp_state::__fpscr"]
        [::std::mem::offset_of!(__darwin_arm_vfp_state, __fpscr) - 256usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_neon_state64 {
    pub __v: [__uint128_t; 32usize],
    pub __fpsr: __uint32_t,
    pub __fpcr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_neon_state64"]
        [::std::mem::size_of::<__darwin_arm_neon_state64>() - 528usize];
    ["Alignment of __darwin_arm_neon_state64"]
        [::std::mem::align_of::<__darwin_arm_neon_state64>() - 16usize];
    ["Offset of field: __darwin_arm_neon_state64::__v"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __v) - 0usize];
    ["Offset of field: __darwin_arm_neon_state64::__fpsr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __fpsr) - 512usize];
    ["Offset of field: __darwin_arm_neon_state64::__fpcr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state64, __fpcr) - 516usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_neon_state {
    pub __v: [__uint128_t; 16usize],
    pub __fpsr: __uint32_t,
    pub __fpcr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_neon_state"]
        [::std::mem::size_of::<__darwin_arm_neon_state>() - 272usize];
    ["Alignment of __darwin_arm_neon_state"]
        [::std::mem::align_of::<__darwin_arm_neon_state>() - 16usize];
    ["Offset of field: __darwin_arm_neon_state::__v"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __v) - 0usize];
    ["Offset of field: __darwin_arm_neon_state::__fpsr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __fpsr) - 256usize];
    ["Offset of field: __darwin_arm_neon_state::__fpcr"]
        [::std::mem::offset_of!(__darwin_arm_neon_state, __fpcr) - 260usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __arm_pagein_state {
    pub __pagein_error: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __arm_pagein_state"][::std::mem::size_of::<__arm_pagein_state>() - 4usize];
    ["Alignment of __arm_pagein_state"][::std::mem::align_of::<__arm_pagein_state>() - 4usize];
    ["Offset of field: __arm_pagein_state::__pagein_error"]
        [::std::mem::offset_of!(__arm_pagein_state, __pagein_error) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_sme_state {
    pub __svcr: __uint64_t,
    pub __tpidr2_el0: __uint64_t,
    pub __svl_b: __uint16_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_sme_state"][::std::mem::size_of::<__darwin_arm_sme_state>() - 24usize];
    ["Alignment of __darwin_arm_sme_state"]
        [::std::mem::align_of::<__darwin_arm_sme_state>() - 8usize];
    ["Offset of field: __darwin_arm_sme_state::__svcr"]
        [::std::mem::offset_of!(__darwin_arm_sme_state, __svcr) - 0usize];
    ["Offset of field: __darwin_arm_sme_state::__tpidr2_el0"]
        [::std::mem::offset_of!(__darwin_arm_sme_state, __tpidr2_el0) - 8usize];
    ["Offset of field: __darwin_arm_sme_state::__svl_b"]
        [::std::mem::offset_of!(__darwin_arm_sme_state, __svl_b) - 16usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_sve_z_state {
    pub __z: [[::std::os::raw::c_char; 256usize]; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_sve_z_state"]
        [::std::mem::size_of::<__darwin_arm_sve_z_state>() - 4096usize];
    ["Alignment of __darwin_arm_sve_z_state"]
        [::std::mem::align_of::<__darwin_arm_sve_z_state>() - 4usize];
    ["Offset of field: __darwin_arm_sve_z_state::__z"]
        [::std::mem::offset_of!(__darwin_arm_sve_z_state, __z) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_sve_p_state {
    pub __p: [[::std::os::raw::c_char; 32usize]; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_sve_p_state"]
        [::std::mem::size_of::<__darwin_arm_sve_p_state>() - 512usize];
    ["Alignment of __darwin_arm_sve_p_state"]
        [::std::mem::align_of::<__darwin_arm_sve_p_state>() - 4usize];
    ["Offset of field: __darwin_arm_sve_p_state::__p"]
        [::std::mem::offset_of!(__darwin_arm_sve_p_state, __p) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_sme_za_state {
    pub __za: [::std::os::raw::c_char; 4096usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_sme_za_state"]
        [::std::mem::size_of::<__darwin_arm_sme_za_state>() - 4096usize];
    ["Alignment of __darwin_arm_sme_za_state"]
        [::std::mem::align_of::<__darwin_arm_sme_za_state>() - 4usize];
    ["Offset of field: __darwin_arm_sme_za_state::__za"]
        [::std::mem::offset_of!(__darwin_arm_sme_za_state, __za) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_sme2_state {
    pub __zt0: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_sme2_state"][::std::mem::size_of::<__darwin_arm_sme2_state>() - 64usize];
    ["Alignment of __darwin_arm_sme2_state"]
        [::std::mem::align_of::<__darwin_arm_sme2_state>() - 4usize];
    ["Offset of field: __darwin_arm_sme2_state::__zt0"]
        [::std::mem::offset_of!(__darwin_arm_sme2_state, __zt0) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __arm_legacy_debug_state {
    pub __bvr: [__uint32_t; 16usize],
    pub __bcr: [__uint32_t; 16usize],
    pub __wvr: [__uint32_t; 16usize],
    pub __wcr: [__uint32_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __arm_legacy_debug_state"]
        [::std::mem::size_of::<__arm_legacy_debug_state>() - 256usize];
    ["Alignment of __arm_legacy_debug_state"]
        [::std::mem::align_of::<__arm_legacy_debug_state>() - 4usize];
    ["Offset of field: __arm_legacy_debug_state::__bvr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __bvr) - 0usize];
    ["Offset of field: __arm_legacy_debug_state::__bcr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __bcr) - 64usize];
    ["Offset of field: __arm_legacy_debug_state::__wvr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __wvr) - 128usize];
    ["Offset of field: __arm_legacy_debug_state::__wcr"]
        [::std::mem::offset_of!(__arm_legacy_debug_state, __wcr) - 192usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_debug_state32 {
    pub __bvr: [__uint32_t; 16usize],
    pub __bcr: [__uint32_t; 16usize],
    pub __wvr: [__uint32_t; 16usize],
    pub __wcr: [__uint32_t; 16usize],
    pub __mdscr_el1: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_debug_state32"]
        [::std::mem::size_of::<__darwin_arm_debug_state32>() - 264usize];
    ["Alignment of __darwin_arm_debug_state32"]
        [::std::mem::align_of::<__darwin_arm_debug_state32>() - 8usize];
    ["Offset of field: __darwin_arm_debug_state32::__bvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __bvr) - 0usize];
    ["Offset of field: __darwin_arm_debug_state32::__bcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __bcr) - 64usize];
    ["Offset of field: __darwin_arm_debug_state32::__wvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __wvr) - 128usize];
    ["Offset of field: __darwin_arm_debug_state32::__wcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __wcr) - 192usize];
    ["Offset of field: __darwin_arm_debug_state32::__mdscr_el1"]
        [::std::mem::offset_of!(__darwin_arm_debug_state32, __mdscr_el1) - 256usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_debug_state64 {
    pub __bvr: [__uint64_t; 16usize],
    pub __bcr: [__uint64_t; 16usize],
    pub __wvr: [__uint64_t; 16usize],
    pub __wcr: [__uint64_t; 16usize],
    pub __mdscr_el1: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_debug_state64"]
        [::std::mem::size_of::<__darwin_arm_debug_state64>() - 520usize];
    ["Alignment of __darwin_arm_debug_state64"]
        [::std::mem::align_of::<__darwin_arm_debug_state64>() - 8usize];
    ["Offset of field: __darwin_arm_debug_state64::__bvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __bvr) - 0usize];
    ["Offset of field: __darwin_arm_debug_state64::__bcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __bcr) - 128usize];
    ["Offset of field: __darwin_arm_debug_state64::__wvr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __wvr) - 256usize];
    ["Offset of field: __darwin_arm_debug_state64::__wcr"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __wcr) - 384usize];
    ["Offset of field: __darwin_arm_debug_state64::__mdscr_el1"]
        [::std::mem::offset_of!(__darwin_arm_debug_state64, __mdscr_el1) - 512usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_arm_cpmu_state64 {
    pub __ctrs: [__uint64_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_arm_cpmu_state64"]
        [::std::mem::size_of::<__darwin_arm_cpmu_state64>() - 128usize];
    ["Alignment of __darwin_arm_cpmu_state64"]
        [::std::mem::align_of::<__darwin_arm_cpmu_state64>() - 8usize];
    ["Offset of field: __darwin_arm_cpmu_state64::__ctrs"]
        [::std::mem::offset_of!(__darwin_arm_cpmu_state64, __ctrs) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext32 {
    pub __es: __darwin_arm_exception_state,
    pub __ss: __darwin_arm_thread_state,
    pub __fs: __darwin_arm_vfp_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext32"][::std::mem::size_of::<__darwin_mcontext32>() - 340usize];
    ["Alignment of __darwin_mcontext32"][::std::mem::align_of::<__darwin_mcontext32>() - 4usize];
    ["Offset of field: __darwin_mcontext32::__es"]
        [::std::mem::offset_of!(__darwin_mcontext32, __es) - 0usize];
    ["Offset of field: __darwin_mcontext32::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext32, __ss) - 12usize];
    ["Offset of field: __darwin_mcontext32::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext32, __fs) - 80usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext64 {
    pub __es: __darwin_arm_exception_state64,
    pub __ss: __darwin_arm_thread_state64,
    pub __ns: __darwin_arm_neon_state64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext64"][::std::mem::size_of::<__darwin_mcontext64>() - 816usize];
    ["Alignment of __darwin_mcontext64"][::std::mem::align_of::<__darwin_mcontext64>() - 16usize];
    ["Offset of field: __darwin_mcontext64::__es"]
        [::std::mem::offset_of!(__darwin_mcontext64, __es) - 0usize];
    ["Offset of field: __darwin_mcontext64::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext64, __ss) - 16usize];
    ["Offset of field: __darwin_mcontext64::__ns"]
        [::std::mem::offset_of!(__darwin_mcontext64, __ns) - 288usize];
};
pub type mcontext_t = *mut __darwin_mcontext64;
pub type pthread_attr_t = __darwin_pthread_attr_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_sigaltstack {
    pub ss_sp: *mut ::std::os::raw::c_void,
    pub ss_size: __darwin_size_t,
    pub ss_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_sigaltstack"][::std::mem::size_of::<__darwin_sigaltstack>() - 24usize];
    ["Alignment of __darwin_sigaltstack"][::std::mem::align_of::<__darwin_sigaltstack>() - 8usize];
    ["Offset of field: __darwin_sigaltstack::ss_sp"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_sp) - 0usize];
    ["Offset of field: __darwin_sigaltstack::ss_size"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_size) - 8usize];
    ["Offset of field: __darwin_sigaltstack::ss_flags"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_flags) - 16usize];
};
pub type stack_t = __darwin_sigaltstack;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_ucontext {
    pub uc_onstack: ::std::os::raw::c_int,
    pub uc_sigmask: __darwin_sigset_t,
    pub uc_stack: __darwin_sigaltstack,
    pub uc_link: *mut __darwin_ucontext,
    pub uc_mcsize: __darwin_size_t,
    pub uc_mcontext: *mut __darwin_mcontext64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_ucontext"][::std::mem::size_of::<__darwin_ucontext>() - 56usize];
    ["Alignment of __darwin_ucontext"][::std::mem::align_of::<__darwin_ucontext>() - 8usize];
    ["Offset of field: __darwin_ucontext::uc_onstack"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_onstack) - 0usize];
    ["Offset of field: __darwin_ucontext::uc_sigmask"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_sigmask) - 4usize];
    ["Offset of field: __darwin_ucontext::uc_stack"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_stack) - 8usize];
    ["Offset of field: __darwin_ucontext::uc_link"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_link) - 32usize];
    ["Offset of field: __darwin_ucontext::uc_mcsize"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_mcsize) - 40usize];
    ["Offset of field: __darwin_ucontext::uc_mcontext"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_mcontext) - 48usize];
};
pub type ucontext_t = __darwin_ucontext;
pub type sigset_t = __darwin_sigset_t;
pub type uid_t = __darwin_uid_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigval"][::std::mem::size_of::<sigval>() - 8usize];
    ["Alignment of sigval"][::std::mem::align_of::<sigval>() - 8usize];
    ["Offset of field: sigval::sival_int"][::std::mem::offset_of!(sigval, sival_int) - 0usize];
    ["Offset of field: sigval::sival_ptr"][::std::mem::offset_of!(sigval, sival_ptr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigevent {
    pub sigev_notify: ::std::os::raw::c_int,
    pub sigev_signo: ::std::os::raw::c_int,
    pub sigev_value: sigval,
    pub sigev_notify_function: ::std::option::Option<unsafe extern "C" fn(arg1: sigval)>,
    pub sigev_notify_attributes: *mut pthread_attr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigevent"][::std::mem::size_of::<sigevent>() - 32usize];
    ["Alignment of sigevent"][::std::mem::align_of::<sigevent>() - 8usize];
    ["Offset of field: sigevent::sigev_notify"]
        [::std::mem::offset_of!(sigevent, sigev_notify) - 0usize];
    ["Offset of field: sigevent::sigev_signo"]
        [::std::mem::offset_of!(sigevent, sigev_signo) - 4usize];
    ["Offset of field: sigevent::sigev_value"]
        [::std::mem::offset_of!(sigevent, sigev_value) - 8usize];
    ["Offset of field: sigevent::sigev_notify_function"]
        [::std::mem::offset_of!(sigevent, sigev_notify_function) - 16usize];
    ["Offset of field: sigevent::sigev_notify_attributes"]
        [::std::mem::offset_of!(sigevent, sigev_notify_attributes) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __siginfo {
    pub si_signo: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub si_pid: pid_t,
    pub si_uid: uid_t,
    pub si_status: ::std::os::raw::c_int,
    pub si_addr: *mut ::std::os::raw::c_void,
    pub si_value: sigval,
    pub si_band: ::std::os::raw::c_long,
    pub __pad: [::std::os::raw::c_ulong; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __siginfo"][::std::mem::size_of::<__siginfo>() - 104usize];
    ["Alignment of __siginfo"][::std::mem::align_of::<__siginfo>() - 8usize];
    ["Offset of field: __siginfo::si_signo"][::std::mem::offset_of!(__siginfo, si_signo) - 0usize];
    ["Offset of field: __siginfo::si_errno"][::std::mem::offset_of!(__siginfo, si_errno) - 4usize];
    ["Offset of field: __siginfo::si_code"][::std::mem::offset_of!(__siginfo, si_code) - 8usize];
    ["Offset of field: __siginfo::si_pid"][::std::mem::offset_of!(__siginfo, si_pid) - 12usize];
    ["Offset of field: __siginfo::si_uid"][::std::mem::offset_of!(__siginfo, si_uid) - 16usize];
    ["Offset of field: __siginfo::si_status"]
        [::std::mem::offset_of!(__siginfo, si_status) - 20usize];
    ["Offset of field: __siginfo::si_addr"][::std::mem::offset_of!(__siginfo, si_addr) - 24usize];
    ["Offset of field: __siginfo::si_value"][::std::mem::offset_of!(__siginfo, si_value) - 32usize];
    ["Offset of field: __siginfo::si_band"][::std::mem::offset_of!(__siginfo, si_band) - 40usize];
    ["Offset of field: __siginfo::__pad"][::std::mem::offset_of!(__siginfo, __pad) - 48usize];
};
pub type siginfo_t = __siginfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __sigaction_u {
    pub __sa_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub __sa_sigaction: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut __siginfo,
            arg3: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigaction_u"][::std::mem::size_of::<__sigaction_u>() - 8usize];
    ["Alignment of __sigaction_u"][::std::mem::align_of::<__sigaction_u>() - 8usize];
    ["Offset of field: __sigaction_u::__sa_handler"]
        [::std::mem::offset_of!(__sigaction_u, __sa_handler) - 0usize];
    ["Offset of field: __sigaction_u::__sa_sigaction"]
        [::std::mem::offset_of!(__sigaction_u, __sa_sigaction) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sigaction {
    pub __sigaction_u: __sigaction_u,
    pub sa_tramp: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: ::std::os::raw::c_int,
            arg3: ::std::os::raw::c_int,
            arg4: *mut siginfo_t,
            arg5: *mut ::std::os::raw::c_void,
        ),
    >,
    pub sa_mask: sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigaction"][::std::mem::size_of::<__sigaction>() - 24usize];
    ["Alignment of __sigaction"][::std::mem::align_of::<__sigaction>() - 8usize];
    ["Offset of field: __sigaction::__sigaction_u"]
        [::std::mem::offset_of!(__sigaction, __sigaction_u) - 0usize];
    ["Offset of field: __sigaction::sa_tramp"]
        [::std::mem::offset_of!(__sigaction, sa_tramp) - 8usize];
    ["Offset of field: __sigaction::sa_mask"]
        [::std::mem::offset_of!(__sigaction, sa_mask) - 16usize];
    ["Offset of field: __sigaction::sa_flags"]
        [::std::mem::offset_of!(__sigaction, sa_flags) - 20usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub __sigaction_u: __sigaction_u,
    pub sa_mask: sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction"][::std::mem::size_of::<sigaction>() - 16usize];
    ["Alignment of sigaction"][::std::mem::align_of::<sigaction>() - 8usize];
    ["Offset of field: sigaction::__sigaction_u"]
        [::std::mem::offset_of!(sigaction, __sigaction_u) - 0usize];
    ["Offset of field: sigaction::sa_mask"][::std::mem::offset_of!(sigaction, sa_mask) - 8usize];
    ["Offset of field: sigaction::sa_flags"][::std::mem::offset_of!(sigaction, sa_flags) - 12usize];
};
pub type sig_t = ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigvec {
    pub sv_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub sv_mask: ::std::os::raw::c_int,
    pub sv_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigvec"][::std::mem::size_of::<sigvec>() - 16usize];
    ["Alignment of sigvec"][::std::mem::align_of::<sigvec>() - 8usize];
    ["Offset of field: sigvec::sv_handler"][::std::mem::offset_of!(sigvec, sv_handler) - 0usize];
    ["Offset of field: sigvec::sv_mask"][::std::mem::offset_of!(sigvec, sv_mask) - 8usize];
    ["Offset of field: sigvec::sv_flags"][::std::mem::offset_of!(sigvec, sv_flags) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigstack {
    pub ss_sp: *mut ::std::os::raw::c_char,
    pub ss_onstack: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigstack"][::std::mem::size_of::<sigstack>() - 16usize];
    ["Alignment of sigstack"][::std::mem::align_of::<sigstack>() - 8usize];
    ["Offset of field: sigstack::ss_sp"][::std::mem::offset_of!(sigstack, ss_sp) - 0usize];
    ["Offset of field: sigstack::ss_onstack"]
        [::std::mem::offset_of!(sigstack, ss_onstack) - 8usize];
};
unsafe extern "C" {
    pub fn signal(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
        ),
    >;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __darwin_time_t,
    pub tv_usec: __darwin_suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
pub type rlim_t = __uint64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage {
    pub ru_utime: timeval,
    pub ru_stime: timeval,
    pub ru_maxrss: ::std::os::raw::c_long,
    pub ru_ixrss: ::std::os::raw::c_long,
    pub ru_idrss: ::std::os::raw::c_long,
    pub ru_isrss: ::std::os::raw::c_long,
    pub ru_minflt: ::std::os::raw::c_long,
    pub ru_majflt: ::std::os::raw::c_long,
    pub ru_nswap: ::std::os::raw::c_long,
    pub ru_inblock: ::std::os::raw::c_long,
    pub ru_oublock: ::std::os::raw::c_long,
    pub ru_msgsnd: ::std::os::raw::c_long,
    pub ru_msgrcv: ::std::os::raw::c_long,
    pub ru_nsignals: ::std::os::raw::c_long,
    pub ru_nvcsw: ::std::os::raw::c_long,
    pub ru_nivcsw: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage"][::std::mem::size_of::<rusage>() - 144usize];
    ["Alignment of rusage"][::std::mem::align_of::<rusage>() - 8usize];
    ["Offset of field: rusage::ru_utime"][::std::mem::offset_of!(rusage, ru_utime) - 0usize];
    ["Offset of field: rusage::ru_stime"][::std::mem::offset_of!(rusage, ru_stime) - 16usize];
    ["Offset of field: rusage::ru_maxrss"][::std::mem::offset_of!(rusage, ru_maxrss) - 32usize];
    ["Offset of field: rusage::ru_ixrss"][::std::mem::offset_of!(rusage, ru_ixrss) - 40usize];
    ["Offset of field: rusage::ru_idrss"][::std::mem::offset_of!(rusage, ru_idrss) - 48usize];
    ["Offset of field: rusage::ru_isrss"][::std::mem::offset_of!(rusage, ru_isrss) - 56usize];
    ["Offset of field: rusage::ru_minflt"][::std::mem::offset_of!(rusage, ru_minflt) - 64usize];
    ["Offset of field: rusage::ru_majflt"][::std::mem::offset_of!(rusage, ru_majflt) - 72usize];
    ["Offset of field: rusage::ru_nswap"][::std::mem::offset_of!(rusage, ru_nswap) - 80usize];
    ["Offset of field: rusage::ru_inblock"][::std::mem::offset_of!(rusage, ru_inblock) - 88usize];
    ["Offset of field: rusage::ru_oublock"][::std::mem::offset_of!(rusage, ru_oublock) - 96usize];
    ["Offset of field: rusage::ru_msgsnd"][::std::mem::offset_of!(rusage, ru_msgsnd) - 104usize];
    ["Offset of field: rusage::ru_msgrcv"][::std::mem::offset_of!(rusage, ru_msgrcv) - 112usize];
    ["Offset of field: rusage::ru_nsignals"]
        [::std::mem::offset_of!(rusage, ru_nsignals) - 120usize];
    ["Offset of field: rusage::ru_nvcsw"][::std::mem::offset_of!(rusage, ru_nvcsw) - 128usize];
    ["Offset of field: rusage::ru_nivcsw"][::std::mem::offset_of!(rusage, ru_nivcsw) - 136usize];
};
pub type rusage_info_t = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v0 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v0"][::std::mem::size_of::<rusage_info_v0>() - 96usize];
    ["Alignment of rusage_info_v0"][::std::mem::align_of::<rusage_info_v0>() - 8usize];
    ["Offset of field: rusage_info_v0::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v0, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v0::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v0, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v0::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v0, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v0::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v0, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v0::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v0, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v0::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v0, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v0::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v0, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v0::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v0, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v0::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v0, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v0::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v0, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v0::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v0, ri_proc_exit_abstime) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v1 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v1"][::std::mem::size_of::<rusage_info_v1>() - 144usize];
    ["Alignment of rusage_info_v1"][::std::mem::align_of::<rusage_info_v1>() - 8usize];
    ["Offset of field: rusage_info_v1::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v1, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v1::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v1::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v1::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v1::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v1::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v1, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v1::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v1, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v1::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v1, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v1::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v1, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v1::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v1, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v1::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v1, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v1::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v1::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v1::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v1::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v1::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v1::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v1, ri_child_elapsed_abstime) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v2 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v2"][::std::mem::size_of::<rusage_info_v2>() - 160usize];
    ["Alignment of rusage_info_v2"][::std::mem::align_of::<rusage_info_v2>() - 8usize];
    ["Offset of field: rusage_info_v2::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v2, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v2::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v2::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v2::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v2::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v2::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v2, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v2::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v2, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v2::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v2, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v2::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v2, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v2::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v2, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v2::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v2, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v2::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v2::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v2::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v2::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v2::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v2::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v2, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v2::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v2, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v2::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v2, ri_diskio_byteswritten) - 152usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v3 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v3"][::std::mem::size_of::<rusage_info_v3>() - 232usize];
    ["Alignment of rusage_info_v3"][::std::mem::align_of::<rusage_info_v3>() - 8usize];
    ["Offset of field: rusage_info_v3::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v3, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v3::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v3::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v3::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v3::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v3::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v3, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v3::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v3, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v3::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v3, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v3::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v3, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v3::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v3, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v3::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v3, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v3::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v3::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v3::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v3::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v3::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v3::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v3, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v3::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v3, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v3::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v3, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v3::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v3, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v3::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v3::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v3, ri_serviced_system_time) - 224usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v4 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
    pub ri_logical_writes: u64,
    pub ri_lifetime_max_phys_footprint: u64,
    pub ri_instructions: u64,
    pub ri_cycles: u64,
    pub ri_billed_energy: u64,
    pub ri_serviced_energy: u64,
    pub ri_interval_max_phys_footprint: u64,
    pub ri_runnable_time: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v4"][::std::mem::size_of::<rusage_info_v4>() - 296usize];
    ["Alignment of rusage_info_v4"][::std::mem::align_of::<rusage_info_v4>() - 8usize];
    ["Offset of field: rusage_info_v4::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v4, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v4::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v4::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v4::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v4::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v4::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v4, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v4::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v4, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v4::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v4, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v4::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v4, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v4::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v4, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v4::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v4, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v4::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v4::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v4::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v4::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v4::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v4::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v4, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v4::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v4, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v4::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v4, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v4::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v4::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v4::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_serviced_system_time) - 224usize];
    ["Offset of field: rusage_info_v4::ri_logical_writes"]
        [::std::mem::offset_of!(rusage_info_v4, ri_logical_writes) - 232usize];
    ["Offset of field: rusage_info_v4::ri_lifetime_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v4, ri_lifetime_max_phys_footprint) - 240usize];
    ["Offset of field: rusage_info_v4::ri_instructions"]
        [::std::mem::offset_of!(rusage_info_v4, ri_instructions) - 248usize];
    ["Offset of field: rusage_info_v4::ri_cycles"]
        [::std::mem::offset_of!(rusage_info_v4, ri_cycles) - 256usize];
    ["Offset of field: rusage_info_v4::ri_billed_energy"]
        [::std::mem::offset_of!(rusage_info_v4, ri_billed_energy) - 264usize];
    ["Offset of field: rusage_info_v4::ri_serviced_energy"]
        [::std::mem::offset_of!(rusage_info_v4, ri_serviced_energy) - 272usize];
    ["Offset of field: rusage_info_v4::ri_interval_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v4, ri_interval_max_phys_footprint) - 280usize];
    ["Offset of field: rusage_info_v4::ri_runnable_time"]
        [::std::mem::offset_of!(rusage_info_v4, ri_runnable_time) - 288usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v5 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
    pub ri_logical_writes: u64,
    pub ri_lifetime_max_phys_footprint: u64,
    pub ri_instructions: u64,
    pub ri_cycles: u64,
    pub ri_billed_energy: u64,
    pub ri_serviced_energy: u64,
    pub ri_interval_max_phys_footprint: u64,
    pub ri_runnable_time: u64,
    pub ri_flags: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v5"][::std::mem::size_of::<rusage_info_v5>() - 304usize];
    ["Alignment of rusage_info_v5"][::std::mem::align_of::<rusage_info_v5>() - 8usize];
    ["Offset of field: rusage_info_v5::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v5, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v5::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v5::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v5::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v5::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v5::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v5, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v5::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v5, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v5::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v5, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v5::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v5, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v5::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v5, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v5::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v5, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v5::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v5::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v5::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v5::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v5::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v5::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v5, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v5::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v5, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v5::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v5, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v5::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v5::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v5::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_serviced_system_time) - 224usize];
    ["Offset of field: rusage_info_v5::ri_logical_writes"]
        [::std::mem::offset_of!(rusage_info_v5, ri_logical_writes) - 232usize];
    ["Offset of field: rusage_info_v5::ri_lifetime_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v5, ri_lifetime_max_phys_footprint) - 240usize];
    ["Offset of field: rusage_info_v5::ri_instructions"]
        [::std::mem::offset_of!(rusage_info_v5, ri_instructions) - 248usize];
    ["Offset of field: rusage_info_v5::ri_cycles"]
        [::std::mem::offset_of!(rusage_info_v5, ri_cycles) - 256usize];
    ["Offset of field: rusage_info_v5::ri_billed_energy"]
        [::std::mem::offset_of!(rusage_info_v5, ri_billed_energy) - 264usize];
    ["Offset of field: rusage_info_v5::ri_serviced_energy"]
        [::std::mem::offset_of!(rusage_info_v5, ri_serviced_energy) - 272usize];
    ["Offset of field: rusage_info_v5::ri_interval_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v5, ri_interval_max_phys_footprint) - 280usize];
    ["Offset of field: rusage_info_v5::ri_runnable_time"]
        [::std::mem::offset_of!(rusage_info_v5, ri_runnable_time) - 288usize];
    ["Offset of field: rusage_info_v5::ri_flags"]
        [::std::mem::offset_of!(rusage_info_v5, ri_flags) - 296usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rusage_info_v6 {
    pub ri_uuid: [u8; 16usize],
    pub ri_user_time: u64,
    pub ri_system_time: u64,
    pub ri_pkg_idle_wkups: u64,
    pub ri_interrupt_wkups: u64,
    pub ri_pageins: u64,
    pub ri_wired_size: u64,
    pub ri_resident_size: u64,
    pub ri_phys_footprint: u64,
    pub ri_proc_start_abstime: u64,
    pub ri_proc_exit_abstime: u64,
    pub ri_child_user_time: u64,
    pub ri_child_system_time: u64,
    pub ri_child_pkg_idle_wkups: u64,
    pub ri_child_interrupt_wkups: u64,
    pub ri_child_pageins: u64,
    pub ri_child_elapsed_abstime: u64,
    pub ri_diskio_bytesread: u64,
    pub ri_diskio_byteswritten: u64,
    pub ri_cpu_time_qos_default: u64,
    pub ri_cpu_time_qos_maintenance: u64,
    pub ri_cpu_time_qos_background: u64,
    pub ri_cpu_time_qos_utility: u64,
    pub ri_cpu_time_qos_legacy: u64,
    pub ri_cpu_time_qos_user_initiated: u64,
    pub ri_cpu_time_qos_user_interactive: u64,
    pub ri_billed_system_time: u64,
    pub ri_serviced_system_time: u64,
    pub ri_logical_writes: u64,
    pub ri_lifetime_max_phys_footprint: u64,
    pub ri_instructions: u64,
    pub ri_cycles: u64,
    pub ri_billed_energy: u64,
    pub ri_serviced_energy: u64,
    pub ri_interval_max_phys_footprint: u64,
    pub ri_runnable_time: u64,
    pub ri_flags: u64,
    pub ri_user_ptime: u64,
    pub ri_system_ptime: u64,
    pub ri_pinstructions: u64,
    pub ri_pcycles: u64,
    pub ri_energy_nj: u64,
    pub ri_penergy_nj: u64,
    pub ri_secure_time_in_system: u64,
    pub ri_secure_ptime_in_system: u64,
    pub ri_neural_footprint: u64,
    pub ri_lifetime_max_neural_footprint: u64,
    pub ri_interval_max_neural_footprint: u64,
    pub ri_reserved: [u64; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rusage_info_v6"][::std::mem::size_of::<rusage_info_v6>() - 464usize];
    ["Alignment of rusage_info_v6"][::std::mem::align_of::<rusage_info_v6>() - 8usize];
    ["Offset of field: rusage_info_v6::ri_uuid"]
        [::std::mem::offset_of!(rusage_info_v6, ri_uuid) - 0usize];
    ["Offset of field: rusage_info_v6::ri_user_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_user_time) - 16usize];
    ["Offset of field: rusage_info_v6::ri_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_system_time) - 24usize];
    ["Offset of field: rusage_info_v6::ri_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pkg_idle_wkups) - 32usize];
    ["Offset of field: rusage_info_v6::ri_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_interrupt_wkups) - 40usize];
    ["Offset of field: rusage_info_v6::ri_pageins"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pageins) - 48usize];
    ["Offset of field: rusage_info_v6::ri_wired_size"]
        [::std::mem::offset_of!(rusage_info_v6, ri_wired_size) - 56usize];
    ["Offset of field: rusage_info_v6::ri_resident_size"]
        [::std::mem::offset_of!(rusage_info_v6, ri_resident_size) - 64usize];
    ["Offset of field: rusage_info_v6::ri_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_phys_footprint) - 72usize];
    ["Offset of field: rusage_info_v6::ri_proc_start_abstime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_proc_start_abstime) - 80usize];
    ["Offset of field: rusage_info_v6::ri_proc_exit_abstime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_proc_exit_abstime) - 88usize];
    ["Offset of field: rusage_info_v6::ri_child_user_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_user_time) - 96usize];
    ["Offset of field: rusage_info_v6::ri_child_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_system_time) - 104usize];
    ["Offset of field: rusage_info_v6::ri_child_pkg_idle_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_pkg_idle_wkups) - 112usize];
    ["Offset of field: rusage_info_v6::ri_child_interrupt_wkups"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_interrupt_wkups) - 120usize];
    ["Offset of field: rusage_info_v6::ri_child_pageins"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_pageins) - 128usize];
    ["Offset of field: rusage_info_v6::ri_child_elapsed_abstime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_child_elapsed_abstime) - 136usize];
    ["Offset of field: rusage_info_v6::ri_diskio_bytesread"]
        [::std::mem::offset_of!(rusage_info_v6, ri_diskio_bytesread) - 144usize];
    ["Offset of field: rusage_info_v6::ri_diskio_byteswritten"]
        [::std::mem::offset_of!(rusage_info_v6, ri_diskio_byteswritten) - 152usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_default"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_default) - 160usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_maintenance"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_maintenance) - 168usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_background"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_background) - 176usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_utility"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_utility) - 184usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_legacy"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_legacy) - 192usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_user_initiated"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_user_initiated) - 200usize];
    ["Offset of field: rusage_info_v6::ri_cpu_time_qos_user_interactive"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cpu_time_qos_user_interactive) - 208usize];
    ["Offset of field: rusage_info_v6::ri_billed_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_billed_system_time) - 216usize];
    ["Offset of field: rusage_info_v6::ri_serviced_system_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_serviced_system_time) - 224usize];
    ["Offset of field: rusage_info_v6::ri_logical_writes"]
        [::std::mem::offset_of!(rusage_info_v6, ri_logical_writes) - 232usize];
    ["Offset of field: rusage_info_v6::ri_lifetime_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_lifetime_max_phys_footprint) - 240usize];
    ["Offset of field: rusage_info_v6::ri_instructions"]
        [::std::mem::offset_of!(rusage_info_v6, ri_instructions) - 248usize];
    ["Offset of field: rusage_info_v6::ri_cycles"]
        [::std::mem::offset_of!(rusage_info_v6, ri_cycles) - 256usize];
    ["Offset of field: rusage_info_v6::ri_billed_energy"]
        [::std::mem::offset_of!(rusage_info_v6, ri_billed_energy) - 264usize];
    ["Offset of field: rusage_info_v6::ri_serviced_energy"]
        [::std::mem::offset_of!(rusage_info_v6, ri_serviced_energy) - 272usize];
    ["Offset of field: rusage_info_v6::ri_interval_max_phys_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_interval_max_phys_footprint) - 280usize];
    ["Offset of field: rusage_info_v6::ri_runnable_time"]
        [::std::mem::offset_of!(rusage_info_v6, ri_runnable_time) - 288usize];
    ["Offset of field: rusage_info_v6::ri_flags"]
        [::std::mem::offset_of!(rusage_info_v6, ri_flags) - 296usize];
    ["Offset of field: rusage_info_v6::ri_user_ptime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_user_ptime) - 304usize];
    ["Offset of field: rusage_info_v6::ri_system_ptime"]
        [::std::mem::offset_of!(rusage_info_v6, ri_system_ptime) - 312usize];
    ["Offset of field: rusage_info_v6::ri_pinstructions"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pinstructions) - 320usize];
    ["Offset of field: rusage_info_v6::ri_pcycles"]
        [::std::mem::offset_of!(rusage_info_v6, ri_pcycles) - 328usize];
    ["Offset of field: rusage_info_v6::ri_energy_nj"]
        [::std::mem::offset_of!(rusage_info_v6, ri_energy_nj) - 336usize];
    ["Offset of field: rusage_info_v6::ri_penergy_nj"]
        [::std::mem::offset_of!(rusage_info_v6, ri_penergy_nj) - 344usize];
    ["Offset of field: rusage_info_v6::ri_secure_time_in_system"]
        [::std::mem::offset_of!(rusage_info_v6, ri_secure_time_in_system) - 352usize];
    ["Offset of field: rusage_info_v6::ri_secure_ptime_in_system"]
        [::std::mem::offset_of!(rusage_info_v6, ri_secure_ptime_in_system) - 360usize];
    ["Offset of field: rusage_info_v6::ri_neural_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_neural_footprint) - 368usize];
    ["Offset of field: rusage_info_v6::ri_lifetime_max_neural_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_lifetime_max_neural_footprint) - 376usize];
    ["Offset of field: rusage_info_v6::ri_interval_max_neural_footprint"]
        [::std::mem::offset_of!(rusage_info_v6, ri_interval_max_neural_footprint) - 384usize];
    ["Offset of field: rusage_info_v6::ri_reserved"]
        [::std::mem::offset_of!(rusage_info_v6, ri_reserved) - 392usize];
};
pub type rusage_info_current = rusage_info_v6;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rlimit {
    pub rlim_cur: rlim_t,
    pub rlim_max: rlim_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rlimit"][::std::mem::size_of::<rlimit>() - 16usize];
    ["Alignment of rlimit"][::std::mem::align_of::<rlimit>() - 8usize];
    ["Offset of field: rlimit::rlim_cur"][::std::mem::offset_of!(rlimit, rlim_cur) - 0usize];
    ["Offset of field: rlimit::rlim_max"][::std::mem::offset_of!(rlimit, rlim_max) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct proc_rlimit_control_wakeupmon {
    pub wm_flags: u32,
    pub wm_rate: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of proc_rlimit_control_wakeupmon"]
        [::std::mem::size_of::<proc_rlimit_control_wakeupmon>() - 8usize];
    ["Alignment of proc_rlimit_control_wakeupmon"]
        [::std::mem::align_of::<proc_rlimit_control_wakeupmon>() - 4usize];
    ["Offset of field: proc_rlimit_control_wakeupmon::wm_flags"]
        [::std::mem::offset_of!(proc_rlimit_control_wakeupmon, wm_flags) - 0usize];
    ["Offset of field: proc_rlimit_control_wakeupmon::wm_rate"]
        [::std::mem::offset_of!(proc_rlimit_control_wakeupmon, wm_rate) - 4usize];
};
unsafe extern "C" {
    pub fn getpriority(arg1: ::std::os::raw::c_int, arg2: id_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getiopolicy_np(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getrlimit(arg1: ::std::os::raw::c_int, arg2: *mut rlimit) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getrusage(arg1: ::std::os::raw::c_int, arg2: *mut rusage) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setpriority(
        arg1: ::std::os::raw::c_int,
        arg2: id_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setiopolicy_np(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setrlimit(arg1: ::std::os::raw::c_int, arg2: *const rlimit) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union wait {
    pub w_status: ::std::os::raw::c_int,
    pub w_T: wait__bindgen_ty_1,
    pub w_S: wait__bindgen_ty_2,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait__bindgen_ty_1"][::std::mem::size_of::<wait__bindgen_ty_1>() - 4usize];
    ["Alignment of wait__bindgen_ty_1"][::std::mem::align_of::<wait__bindgen_ty_1>() - 4usize];
};
impl wait__bindgen_ty_1 {
    #[inline]
    pub fn w_Termsig(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u32) }
    }
    #[inline]
    pub fn set_w_Termsig(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Termsig_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                7u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Termsig_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Coredump(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_w_Coredump(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Coredump_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Coredump_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Retcode(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_w_Retcode(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Retcode_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Retcode_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Filler(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_w_Filler(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Filler_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                16u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Filler_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        w_Termsig: ::std::os::raw::c_uint,
        w_Coredump: ::std::os::raw::c_uint,
        w_Retcode: ::std::os::raw::c_uint,
        w_Filler: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let w_Termsig: u32 = unsafe { ::std::mem::transmute(w_Termsig) };
            w_Termsig as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let w_Coredump: u32 = unsafe { ::std::mem::transmute(w_Coredump) };
            w_Coredump as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let w_Retcode: u32 = unsafe { ::std::mem::transmute(w_Retcode) };
            w_Retcode as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let w_Filler: u32 = unsafe { ::std::mem::transmute(w_Filler) };
            w_Filler as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct wait__bindgen_ty_2 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait__bindgen_ty_2"][::std::mem::size_of::<wait__bindgen_ty_2>() - 4usize];
    ["Alignment of wait__bindgen_ty_2"][::std::mem::align_of::<wait__bindgen_ty_2>() - 4usize];
};
impl wait__bindgen_ty_2 {
    #[inline]
    pub fn w_Stopval(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_w_Stopval(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Stopval_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Stopval_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Stopsig(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_w_Stopsig(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Stopsig_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Stopsig_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn w_Filler(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_w_Filler(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn w_Filler_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                16u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_w_Filler_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        w_Stopval: ::std::os::raw::c_uint,
        w_Stopsig: ::std::os::raw::c_uint,
        w_Filler: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let w_Stopval: u32 = unsafe { ::std::mem::transmute(w_Stopval) };
            w_Stopval as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let w_Stopsig: u32 = unsafe { ::std::mem::transmute(w_Stopsig) };
            w_Stopsig as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let w_Filler: u32 = unsafe { ::std::mem::transmute(w_Filler) };
            w_Filler as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wait"][::std::mem::size_of::<wait>() - 4usize];
    ["Alignment of wait"][::std::mem::align_of::<wait>() - 4usize];
    ["Offset of field: wait::w_status"][::std::mem::offset_of!(wait, w_status) - 0usize];
    ["Offset of field: wait::w_T"][::std::mem::offset_of!(wait, w_T) - 0usize];
    ["Offset of field: wait::w_S"][::std::mem::offset_of!(wait, w_S) - 0usize];
};
unsafe extern "C" {
    pub fn wait(arg1: *mut ::std::os::raw::c_int) -> pid_t;
}
unsafe extern "C" {
    pub fn waitpid(
        arg1: pid_t,
        arg2: *mut ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> pid_t;
}
unsafe extern "C" {
    pub fn waitid(
        arg1: idtype_t,
        arg2: id_t,
        arg3: *mut siginfo_t,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wait3(
        arg1: *mut ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: *mut rusage,
    ) -> pid_t;
}
unsafe extern "C" {
    pub fn wait4(
        arg1: pid_t,
        arg2: *mut ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *mut rusage,
    ) -> pid_t;
}
unsafe extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
pub type ct_rune_t = __darwin_ct_rune_t;
pub type rune_t = __darwin_rune_t;
pub type wchar_t = __darwin_wchar_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub static mut __mb_cur_max: ::std::os::raw::c_int;
}
pub type malloc_type_id_t = ::std::os::raw::c_ulonglong;
unsafe extern "C" {
    pub fn malloc_type_malloc(
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_calloc(
        count: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_free(ptr: *mut ::std::os::raw::c_void, type_id: malloc_type_id_t);
}
unsafe extern "C" {
    pub fn malloc_type_realloc(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_valloc(
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_aligned_alloc(
        alignment: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_posix_memalign(
        memptr: *mut *mut ::std::os::raw::c_void,
        alignment: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _malloc_zone_t {
    _unused: [u8; 0],
}
pub type malloc_zone_t = _malloc_zone_t;
unsafe extern "C" {
    pub fn malloc_type_zone_malloc(
        zone: *mut malloc_zone_t,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_calloc(
        zone: *mut malloc_zone_t,
        count: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_free(
        zone: *mut malloc_zone_t,
        ptr: *mut ::std::os::raw::c_void,
        type_id: malloc_type_id_t,
    );
}
unsafe extern "C" {
    pub fn malloc_type_zone_realloc(
        zone: *mut malloc_zone_t,
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_valloc(
        zone: *mut malloc_zone_t,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc_type_zone_memalign(
        zone: *mut malloc_zone_t,
        alignment: usize,
        size: usize,
        type_id: malloc_type_id_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __count: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(arg1: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn reallocf(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn abs(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atexit(arg1: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        arg1: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atof(arg1: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn div(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn exit(arg1: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn labs(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn ldiv(arg1: ::std::os::raw::c_long, arg2: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn llabs(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn lldiv(arg1: ::std::os::raw::c_longlong, arg2: ::std::os::raw::c_longlong) -> lldiv_t;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(arg1: *mut wchar_t, arg2: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn mbtowc(
        arg1: *mut wchar_t,
        arg2: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn quick_exit(arg1: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn strtod(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtol(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtold(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtoll(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoul(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoull(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn system(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wcstombs(arg1: *mut ::std::os::raw::c_char, arg2: *const wchar_t, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn wctomb(arg1: *mut ::std::os::raw::c_char, arg2: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _Exit(arg1: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn a64l(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn ecvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn erand48(arg1: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn fcvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        arg1: f64,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getsubopt(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn grantpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut ::std::os::raw::c_char,
        __size: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn jrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn l64a(arg1: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn lcong48(arg1: *mut ::std::os::raw::c_ushort);
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mktemp(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn posix_openpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ptsname(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ptsname_r(
        fildes: ::std::os::raw::c_int,
        buffer: *mut ::std::os::raw::c_char,
        buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn putenv(arg1: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn rand_r(arg1: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}_realpath$DARWIN_EXTSN"]
    pub fn realpath(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn seed48(arg1: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __overwrite: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setkey(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn setstate(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn srand48(arg1: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn srandom(arg1: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn unlockpt(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
pub type dev_t = __darwin_dev_t;
pub type mode_t = __darwin_mode_t;
unsafe extern "C" {
    pub fn arc4random() -> u32;
}
unsafe extern "C" {
    pub fn arc4random_addrandom(
        arg1: *mut ::std::os::raw::c_uchar,
        __datlen: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __nbytes: usize);
}
unsafe extern "C" {
    pub fn arc4random_stir();
}
unsafe extern "C" {
    pub fn arc4random_uniform(__upper_bound: u32) -> u32;
}
unsafe extern "C" {
    pub fn atexit_b(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bsearch_b(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn cgetcap(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn cgetclose() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetent(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetfirst(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetmatch(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetnext(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetnum(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetset(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetstr(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn cgetustr(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn daemon(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn devname(arg1: dev_t, arg2: mode_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn devname_r(
        arg1: dev_t,
        arg2: mode_t,
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getbsize(
        arg1: *mut ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn getloadavg(arg1: *mut f64, __nelem: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getprogname() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setprogname(arg1: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn heapsort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn heapsort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mergesort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mergesort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn psort(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *const ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn psort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn psort_r(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        arg1: *mut ::std::os::raw::c_void,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
                arg3: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn qsort_b(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        __compar: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn qsort_r(
        __base: *mut ::std::os::raw::c_void,
        __nel: usize,
        __width: usize,
        arg1: *mut ::std::os::raw::c_void,
        __compar: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_void,
                arg3: *const ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
    );
}
unsafe extern "C" {
    pub fn radixsort(
        __base: *mut *const ::std::os::raw::c_uchar,
        __nel: ::std::os::raw::c_int,
        __table: *const ::std::os::raw::c_uchar,
        __endbyte: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rpmatch(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sradixsort(
        __base: *mut *const ::std::os::raw::c_uchar,
        __nel: ::std::os::raw::c_int,
        __table: *const ::std::os::raw::c_uchar,
        __endbyte: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sranddev();
}
unsafe extern "C" {
    pub fn srandomdev();
}
unsafe extern "C" {
    pub fn strtonum(
        __numstr: *const ::std::os::raw::c_char,
        __minval: ::std::os::raw::c_longlong,
        __maxval: ::std::os::raw::c_longlong,
        __errstrp: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoq(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __str: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub static mut suboptarg: *mut ::std::os::raw::c_char;
}
pub type rsize_t = ::std::os::raw::c_ulong;
pub type max_align_t = f64;
unsafe extern "C" {
    #[doc = " allocates array and initializes it with 0; returns NULL if memory allocation failed"]
    pub fn BMSallocClearMemory_call(
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates memory; returns NULL if memory allocation failed"]
    pub fn BMSallocMemory_call(
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates array; returns NULL if memory allocation failed"]
    pub fn BMSallocMemoryArray_call(
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates memory; returns NULL if memory allocation failed"]
    pub fn BMSreallocMemory_call(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " reallocates array; returns NULL if memory allocation failed"]
    pub fn BMSreallocMemoryArray_call(
        ptr: *mut ::std::os::raw::c_void,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " clears a memory element (i.e. fills it with zeros)"]
    pub fn BMSclearMemory_call(ptr: *mut ::std::os::raw::c_void, size: usize);
}
unsafe extern "C" {
    #[doc = " copies the contents of one memory element into another memory element"]
    pub fn BMScopyMemory_call(
        ptr: *mut ::std::os::raw::c_void,
        source: *const ::std::os::raw::c_void,
        size: usize,
    );
}
unsafe extern "C" {
    #[doc = " moves the contents of one memory element into another memory element, should be used if both elements overlap,\n  otherwise BMScopyMemory is faster"]
    pub fn BMSmoveMemory_call(
        ptr: *mut ::std::os::raw::c_void,
        source: *const ::std::os::raw::c_void,
        size: usize,
    );
}
unsafe extern "C" {
    #[doc = " allocates memory and copies the contents of the given memory element into the new memory element"]
    pub fn BMSduplicateMemory_call(
        source: *const ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates array and copies the contents of the given source array into the new array"]
    pub fn BMSduplicateMemoryArray_call(
        source: *const ::std::os::raw::c_void,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " frees an allocated memory element and sets pointer to NULL"]
    pub fn BMSfreeMemory_call(
        ptr: *mut *mut ::std::os::raw::c_void,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " frees an allocated memory element if pointer is not NULL and sets pointer to NULL"]
    pub fn BMSfreeMemoryNull_call(
        ptr: *mut *mut ::std::os::raw::c_void,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " returns the size of an allocated memory element"]
    pub fn BMSgetPointerSize_call(ptr: *const ::std::os::raw::c_void) -> usize;
}
unsafe extern "C" {
    #[doc = " outputs information about currently allocated memory to the screen"]
    pub fn BMSdisplayMemory_call();
}
unsafe extern "C" {
    #[doc = " displays a warning message on the screen, if allocated memory exists"]
    pub fn BMScheckEmptyMemory_call();
}
unsafe extern "C" {
    #[doc = " returns total number of allocated bytes"]
    pub fn BMSgetMemoryUsed_call() -> ::std::os::raw::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BMS_ChkMem {
    _unused: [u8; 0],
}
#[doc = " Chunk Memory Management\n\n Efficient memory management for multiple objects of the same size"]
pub type BMS_CHKMEM = BMS_ChkMem;
unsafe extern "C" {
    #[doc = " aligns the given byte size corresponding to the minimal alignment for chunk and block memory"]
    pub fn BMSalignMemsize(size: *mut usize);
}
unsafe extern "C" {
    #[doc = " checks whether the given size meets the alignment conditions for chunk and block memory"]
    pub fn BMSisAligned(size: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " creates a new chunk block data structure"]
    pub fn BMScreateChunkMemory_call(
        size: usize,
        initchunksize: ::std::os::raw::c_int,
        garbagefactor: ::std::os::raw::c_int,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut BMS_CHKMEM;
}
unsafe extern "C" {
    #[doc = " clears a chunk block data structure"]
    pub fn BMSclearChunkMemory_call(
        chkmem: *mut BMS_CHKMEM,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " destroys and frees a chunk block data structure"]
    pub fn BMSdestroyChunkMemory_call(
        chkmem: *mut *mut BMS_CHKMEM,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " allocates a memory element of the given chunk block"]
    pub fn BMSallocChunkMemory_call(
        chkmem: *mut BMS_CHKMEM,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " duplicates a given memory element by allocating a new element of the same chunk block and copying the data"]
    pub fn BMSduplicateChunkMemory_call(
        chkmem: *mut BMS_CHKMEM,
        source: *const ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " frees a memory element of the given chunk block and sets pointer to NULL"]
    pub fn BMSfreeChunkMemory_call(
        chkmem: *mut BMS_CHKMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " frees a memory element of the given chunk block if pointer is not NULL and sets pointer to NULL"]
    pub fn BMSfreeChunkMemoryNull_call(
        chkmem: *mut BMS_CHKMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " calls garbage collection of chunk block and frees chunks without allocated memory elements"]
    pub fn BMSgarbagecollectChunkMemory_call(chkmem: *mut BMS_CHKMEM);
}
unsafe extern "C" {
    #[doc = " returns the number of allocated bytes in the chunk block"]
    pub fn BMSgetChunkMemoryUsed_call(chkmem: *const BMS_CHKMEM) -> ::std::os::raw::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BMS_BlkMem {
    _unused: [u8; 0],
}
#[doc = " Block Memory Management\n\n Efficient memory management for objects of varying sizes"]
pub type BMS_BLKMEM = BMS_BlkMem;
unsafe extern "C" {
    #[doc = " creates a block memory allocation data structure"]
    pub fn BMScreateBlockMemory_call(
        initchunksize: ::std::os::raw::c_int,
        garbagefactor: ::std::os::raw::c_int,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut BMS_BLKMEM;
}
unsafe extern "C" {
    #[doc = " frees all chunk blocks in the block memory"]
    pub fn BMSclearBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " clears and deletes block memory"]
    pub fn BMSdestroyBlockMemory_call(
        blkmem: *mut *mut BMS_BLKMEM,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " allocates memory in the block memory pool"]
    pub fn BMSallocBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates memory in the block memory pool and clears it"]
    pub fn BMSallocClearBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates array in the block memory pool"]
    pub fn BMSallocBlockMemoryArray_call(
        blkmem: *mut BMS_BLKMEM,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates array in the block memory pool and clears it"]
    pub fn BMSallocClearBlockMemoryArray_call(
        blkmem: *mut BMS_BLKMEM,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " resizes memory element in the block memory pool and copies the data"]
    pub fn BMSreallocBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        ptr: *mut ::std::os::raw::c_void,
        oldsize: usize,
        newsize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " resizes array in the block memory pool and copies the data"]
    pub fn BMSreallocBlockMemoryArray_call(
        blkmem: *mut BMS_BLKMEM,
        ptr: *mut ::std::os::raw::c_void,
        oldnum: usize,
        newnum: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " duplicates memory element in the block memory pool and copies the data"]
    pub fn BMSduplicateBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        source: *const ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " duplicates array in the block memory pool and copies the data"]
    pub fn BMSduplicateBlockMemoryArray_call(
        blkmem: *mut BMS_BLKMEM,
        source: *const ::std::os::raw::c_void,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " frees memory element in the block memory pool and sets pointer to NULL"]
    pub fn BMSfreeBlockMemory_call(
        blkmem: *mut BMS_BLKMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " frees memory element in the block memory pool if pointer is not NULL and sets pointer to NULL"]
    pub fn BMSfreeBlockMemoryNull_call(
        blkmem: *mut BMS_BLKMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " calls garbage collection of block memory, frees chunks without allocated memory elements, and frees\n  chunk blocks without any chunks"]
    pub fn BMSgarbagecollectBlockMemory_call(blkmem: *mut BMS_BLKMEM);
}
unsafe extern "C" {
    #[doc = " returns the number of allocated bytes in the block memory"]
    pub fn BMSgetBlockMemoryAllocated_call(blkmem: *const BMS_BLKMEM)
    -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    #[doc = " returns the number of used bytes in the block memory"]
    pub fn BMSgetBlockMemoryUsed_call(blkmem: *const BMS_BLKMEM) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    #[doc = " returns the number of allocated but not used bytes in the block memory"]
    pub fn BMSgetBlockMemoryUnused_call(blkmem: *const BMS_BLKMEM) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    #[doc = " returns the maximal number of used bytes in the block memory"]
    pub fn BMSgetBlockMemoryUsedMax_call(blkmem: *const BMS_BLKMEM) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    #[doc = " returns the maximal number of allocated but not used bytes in the block memory"]
    pub fn BMSgetBlockMemoryUnusedMax_call(blkmem: *const BMS_BLKMEM)
    -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    #[doc = " returns the maximal number of allocated bytes in the block memory"]
    pub fn BMSgetBlockMemoryAllocatedMax_call(
        blkmem: *const BMS_BLKMEM,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    #[doc = " returns the size of the given memory element; returns 0, if the element is not member of the block memory"]
    pub fn BMSgetBlockPointerSize_call(
        blkmem: *const BMS_BLKMEM,
        ptr: *const ::std::os::raw::c_void,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " outputs allocation diagnostics of block memory"]
    pub fn BMSdisplayBlockMemory_call(blkmem: *const BMS_BLKMEM);
}
unsafe extern "C" {
    #[doc = " outputs error messages, if there are allocated elements in the block memory and returns number of unfreed bytes"]
    pub fn BMScheckEmptyBlockMemory_call(blkmem: *const BMS_BLKMEM) -> ::std::os::raw::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BMS_BufMem {
    _unused: [u8; 0],
}
#[doc = " Buffer Memory Management\n\n Efficient memory management for temporary objects"]
pub type BMS_BUFMEM = BMS_BufMem;
unsafe extern "C" {
    #[doc = " creates memory buffer storage"]
    pub fn BMScreateBufferMemory_call(
        arraygrowfac: f64,
        arraygrowinit: ::std::os::raw::c_int,
        clean: ::std::os::raw::c_uint,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut BMS_BUFMEM;
}
unsafe extern "C" {
    #[doc = " destroys buffer memory"]
    pub fn BMSdestroyBufferMemory_call(
        buffer: *mut *mut BMS_BUFMEM,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " set arraygrowfac"]
    pub fn BMSsetBufferMemoryArraygrowfac(buffer: *mut BMS_BUFMEM, arraygrowfac: f64);
}
unsafe extern "C" {
    #[doc = " set arraygrowinit"]
    pub fn BMSsetBufferMemoryArraygrowinit(
        buffer: *mut BMS_BUFMEM,
        arraygrowinit: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " allocates the next unused buffer"]
    pub fn BMSallocBufferMemory_call(
        buffer: *mut BMS_BUFMEM,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates the next unused buffer array"]
    pub fn BMSallocBufferMemoryArray_call(
        buffer: *mut BMS_BUFMEM,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates the next unused buffer and clears it"]
    pub fn BMSallocClearBufferMemoryArray_call(
        buffer: *mut BMS_BUFMEM,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " reallocates the buffer to at least the given size"]
    pub fn BMSreallocBufferMemory_call(
        buffer: *mut BMS_BUFMEM,
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " reallocates an array in the buffer to at least the given size"]
    pub fn BMSreallocBufferMemoryArray_call(
        buffer: *mut BMS_BUFMEM,
        ptr: *mut ::std::os::raw::c_void,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates the next unused buffer and copies the given memory into the buffer"]
    pub fn BMSduplicateBufferMemory_call(
        buffer: *mut BMS_BUFMEM,
        source: *const ::std::os::raw::c_void,
        size: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " allocates an array in the next unused buffer and copies the given memory into the buffer"]
    pub fn BMSduplicateBufferMemoryArray_call(
        buffer: *mut BMS_BUFMEM,
        source: *const ::std::os::raw::c_void,
        num: usize,
        typesize: usize,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    #[doc = " frees a buffer and sets pointer to NULL"]
    pub fn BMSfreeBufferMemory_call(
        buffer: *mut BMS_BUFMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " frees a buffer if pointer is not NULL and sets pointer to NULL"]
    pub fn BMSfreeBufferMemoryNull_call(
        buffer: *mut BMS_BUFMEM,
        ptr: *mut *mut ::std::os::raw::c_void,
        filename: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " gets number of used buffers"]
    pub fn BMSgetNUsedBufferMemory(buffer: *mut BMS_BUFMEM) -> usize;
}
unsafe extern "C" {
    #[doc = " returns the number of allocated bytes in the buffer memory"]
    pub fn BMSgetBufferMemoryUsed(buffer: *const BMS_BUFMEM) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    #[doc = " outputs statistics about currently allocated buffers to the screen"]
    pub fn BMSprintBufferMemory(buffer: *mut BMS_BUFMEM);
}
#[doc = "< normal termination"]
pub const SCIP_Retcode_SCIP_OKAY: SCIP_Retcode = 1;
#[doc = "< unspecified error"]
pub const SCIP_Retcode_SCIP_ERROR: SCIP_Retcode = 0;
#[doc = "< insufficient memory error"]
pub const SCIP_Retcode_SCIP_NOMEMORY: SCIP_Retcode = -1;
#[doc = "< read error"]
pub const SCIP_Retcode_SCIP_READERROR: SCIP_Retcode = -2;
#[doc = "< write error"]
pub const SCIP_Retcode_SCIP_WRITEERROR: SCIP_Retcode = -3;
#[doc = "< file not found error"]
pub const SCIP_Retcode_SCIP_NOFILE: SCIP_Retcode = -4;
#[doc = "< cannot create file"]
pub const SCIP_Retcode_SCIP_FILECREATEERROR: SCIP_Retcode = -5;
#[doc = "< error in LP solver"]
pub const SCIP_Retcode_SCIP_LPERROR: SCIP_Retcode = -6;
#[doc = "< no problem exists"]
pub const SCIP_Retcode_SCIP_NOPROBLEM: SCIP_Retcode = -7;
#[doc = "< method cannot be called at this time in solution process"]
pub const SCIP_Retcode_SCIP_INVALIDCALL: SCIP_Retcode = -8;
#[doc = "< error in input data"]
pub const SCIP_Retcode_SCIP_INVALIDDATA: SCIP_Retcode = -9;
#[doc = "< method returned an invalid result code"]
pub const SCIP_Retcode_SCIP_INVALIDRESULT: SCIP_Retcode = -10;
#[doc = "< a required plugin was not found"]
pub const SCIP_Retcode_SCIP_PLUGINNOTFOUND: SCIP_Retcode = -11;
#[doc = "< the parameter with the given name was not found"]
pub const SCIP_Retcode_SCIP_PARAMETERUNKNOWN: SCIP_Retcode = -12;
#[doc = "< the parameter is not of the expected type"]
pub const SCIP_Retcode_SCIP_PARAMETERWRONGTYPE: SCIP_Retcode = -13;
#[doc = "< the value is invalid for the given parameter"]
pub const SCIP_Retcode_SCIP_PARAMETERWRONGVAL: SCIP_Retcode = -14;
#[doc = "< the given key is already existing in table"]
pub const SCIP_Retcode_SCIP_KEYALREADYEXISTING: SCIP_Retcode = -15;
#[doc = "< maximal branching depth level exceeded"]
pub const SCIP_Retcode_SCIP_MAXDEPTHLEVEL: SCIP_Retcode = -16;
#[doc = "< no branching could be created"]
pub const SCIP_Retcode_SCIP_BRANCHERROR: SCIP_Retcode = -17;
#[doc = "< function not implemented"]
pub const SCIP_Retcode_SCIP_NOTIMPLEMENTED: SCIP_Retcode = -18;
#[doc = " return codes for SCIP methods: non-positive return codes are errors"]
pub type SCIP_Retcode = ::std::os::raw::c_int;
#[doc = " return codes for SCIP methods: non-positive return codes are errors"]
pub use self::SCIP_Retcode as SCIP_RETCODE;
#[doc = "< the method was not executed"]
pub const SCIP_Result_SCIP_DIDNOTRUN: SCIP_Result = 1;
#[doc = "< the method was not executed, but should be called again later"]
pub const SCIP_Result_SCIP_DELAYED: SCIP_Result = 2;
#[doc = "< the method was executed, but failed finding anything"]
pub const SCIP_Result_SCIP_DIDNOTFIND: SCIP_Result = 3;
#[doc = "< no infeasibility could be found"]
pub const SCIP_Result_SCIP_FEASIBLE: SCIP_Result = 4;
#[doc = "< an infeasibility was detected"]
pub const SCIP_Result_SCIP_INFEASIBLE: SCIP_Result = 5;
#[doc = "< an unboundedness was detected"]
pub const SCIP_Result_SCIP_UNBOUNDED: SCIP_Result = 6;
#[doc = "< the current node is infeasible and can be cut off"]
pub const SCIP_Result_SCIP_CUTOFF: SCIP_Result = 7;
#[doc = "< the method added a cutting plane"]
pub const SCIP_Result_SCIP_SEPARATED: SCIP_Result = 8;
#[doc = "< the method added a cutting plane and a new separation round should immediately start"]
pub const SCIP_Result_SCIP_NEWROUND: SCIP_Result = 9;
#[doc = "< the method reduced the domain of a variable"]
pub const SCIP_Result_SCIP_REDUCEDDOM: SCIP_Result = 10;
#[doc = "< the method added a constraint"]
pub const SCIP_Result_SCIP_CONSADDED: SCIP_Result = 11;
#[doc = "< the method changed a constraint"]
pub const SCIP_Result_SCIP_CONSCHANGED: SCIP_Result = 12;
#[doc = "< the method created a branching"]
pub const SCIP_Result_SCIP_BRANCHED: SCIP_Result = 13;
#[doc = "< the current node's LP must be solved"]
pub const SCIP_Result_SCIP_SOLVELP: SCIP_Result = 14;
#[doc = "< the method found a feasible primal solution"]
pub const SCIP_Result_SCIP_FOUNDSOL: SCIP_Result = 15;
#[doc = "< the method interrupted its execution, but can continue if needed"]
pub const SCIP_Result_SCIP_SUSPENDED: SCIP_Result = 16;
#[doc = "< the method was successfully executed"]
pub const SCIP_Result_SCIP_SUCCESS: SCIP_Result = 17;
#[doc = "< the processing of the branch-and-bound node should stopped and continued later"]
pub const SCIP_Result_SCIP_DELAYNODE: SCIP_Result = 18;
#[doc = " result codes for SCIP callback methods"]
pub type SCIP_Result = ::std::os::raw::c_uint;
#[doc = " result codes for SCIP callback methods"]
pub use self::SCIP_Result as SCIP_RESULT;
#[doc = "< use default clock type"]
pub const SCIP_ClockType_SCIP_CLOCKTYPE_DEFAULT: SCIP_ClockType = 0;
#[doc = "< use CPU clock"]
pub const SCIP_ClockType_SCIP_CLOCKTYPE_CPU: SCIP_ClockType = 1;
#[doc = "< use wall clock"]
pub const SCIP_ClockType_SCIP_CLOCKTYPE_WALL: SCIP_ClockType = 2;
pub type SCIP_ClockType = ::std::os::raw::c_uint;
pub use self::SCIP_ClockType as SCIP_CLOCKTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Clock {
    _unused: [u8; 0],
}
pub type SCIP_CLOCK = SCIP_Clock;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_CPUClock {
    _unused: [u8; 0],
}
pub type SCIP_CPUCLOCK = SCIP_CPUClock;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_WallClock {
    _unused: [u8; 0],
}
pub type SCIP_WALLCLOCK = SCIP_WallClock;
#[doc = "< one-sided confidence level 75 %, two-sided 50 %"]
pub const SCIP_Confidencelevel_SCIP_CONFIDENCELEVEL_MIN: SCIP_Confidencelevel = 0;
#[doc = "< (one-sided) confidence level 87.5 %, two-sided 75 %"]
pub const SCIP_Confidencelevel_SCIP_CONFIDENCELEVEL_LOW: SCIP_Confidencelevel = 1;
#[doc = "< (one-sided) confidence level 90 %, two-sided 80 %"]
pub const SCIP_Confidencelevel_SCIP_CONFIDENCELEVEL_MEDIUM: SCIP_Confidencelevel = 2;
#[doc = "< (one-sided) confidence level 95 %, two-sided 90 %"]
pub const SCIP_Confidencelevel_SCIP_CONFIDENCELEVEL_HIGH: SCIP_Confidencelevel = 3;
#[doc = "< (one-sided) confidence level 97.5 %, two-sided 95 %"]
pub const SCIP_Confidencelevel_SCIP_CONFIDENCELEVEL_MAX: SCIP_Confidencelevel = 4;
#[doc = " represents different confidence levels for (one-sided) hypothesis testing; in order to obtain two-sided confidence\n  levels, calculate 2 * c - 1, i.e., if the one-sided confidence level is 90 %, the two-sided level is 80 %"]
pub type SCIP_Confidencelevel = ::std::os::raw::c_uint;
#[doc = " represents different confidence levels for (one-sided) hypothesis testing; in order to obtain two-sided confidence\n  levels, calculate 2 * c - 1, i.e., if the one-sided confidence level is 90 %, the two-sided level is 80 %"]
pub use self::SCIP_Confidencelevel as SCIP_CONFIDENCELEVEL;
#[doc = "< the hashmap did not store a single element yet, type unknown"]
pub const SCIP_Hashmaptype_SCIP_HASHMAPTYPE_UNKNOWN: SCIP_Hashmaptype = 0;
#[doc = "< the hashmap stores pointers %"]
pub const SCIP_Hashmaptype_SCIP_HASHMAPTYPE_POINTER: SCIP_Hashmaptype = 1;
#[doc = "< the hashmap stores reals"]
pub const SCIP_Hashmaptype_SCIP_HASHMAPTYPE_REAL: SCIP_Hashmaptype = 2;
#[doc = "< the hashmap stores ints"]
pub const SCIP_Hashmaptype_SCIP_HASHMAPTYPE_INT: SCIP_Hashmaptype = 3;
#[doc = "< the hashmap stores long ints"]
pub const SCIP_Hashmaptype_SCIP_HASHMAPTYPE_LONG: SCIP_Hashmaptype = 4;
#[doc = " type of hashmap: are pointers, reals or ints stored, or unknown"]
pub type SCIP_Hashmaptype = ::std::os::raw::c_uint;
#[doc = " type of hashmap: are pointers, reals or ints stored, or unknown"]
pub use self::SCIP_Hashmaptype as SCIP_HASHMAPTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SparseSol {
    _unused: [u8; 0],
}
#[doc = " Sparse solution data structure\n\n  - \\ref SparseSol \"List of all available methods\""]
pub type SCIP_SPARSESOL = SCIP_SparseSol;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Queue {
    _unused: [u8; 0],
}
#[doc = " (circular) Queue data structure\n\n  - \\ref Queue \"List of all available methods\""]
pub type SCIP_QUEUE = SCIP_Queue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PQueue {
    _unused: [u8; 0],
}
#[doc = " Priority queue data structure\n\n  - \\ref PriorityQueue \"List of all available methods\""]
pub type SCIP_PQUEUE = SCIP_PQueue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HashTable {
    _unused: [u8; 0],
}
#[doc = " Hash table data structure\n\n  - \\ref HashTable \"List of all available methods\""]
pub type SCIP_HASHTABLE = SCIP_HashTable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_MultiHash {
    _unused: [u8; 0],
}
#[doc = " Hash table data structure which allows multiple occurences of an element\n\n  - \\ref MultiHash \"List of all available methods\""]
pub type SCIP_MULTIHASH = SCIP_MultiHash;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_MultiHashList {
    _unused: [u8; 0],
}
#[doc = " Hash table element list to store single elements of a multi hash table"]
pub type SCIP_MULTIHASHLIST = SCIP_MultiHashList;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HashMapEntry {
    _unused: [u8; 0],
}
#[doc = " Hash map entry"]
pub type SCIP_HASHMAPENTRY = SCIP_HashMapEntry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HashMap {
    _unused: [u8; 0],
}
#[doc = " Hash map data structure\n\n  - \\ref HashMap \"List of all available methods\""]
pub type SCIP_HASHMAP = SCIP_HashMap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HashSet {
    _unused: [u8; 0],
}
#[doc = " Hash set data structure\n\n  - \\ref HashSet \"List of all available methods\""]
pub type SCIP_HASHSET = SCIP_HashSet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_RealArray {
    _unused: [u8; 0],
}
#[doc = " dynamic array for storing SCIP_Real values"]
pub type SCIP_REALARRAY = SCIP_RealArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_IntArray {
    _unused: [u8; 0],
}
#[doc = " dynamic array for storing int values"]
pub type SCIP_INTARRAY = SCIP_IntArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BoolArray {
    _unused: [u8; 0],
}
#[doc = " dynamic array for storing SCIP_Bool values"]
pub type SCIP_BOOLARRAY = SCIP_BoolArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PtrArray {
    _unused: [u8; 0],
}
#[doc = " dynamic array for storing pointers"]
pub type SCIP_PTRARRAY = SCIP_PtrArray;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_RandNumGen {
    _unused: [u8; 0],
}
#[doc = " random number generator"]
pub type SCIP_RANDNUMGEN = SCIP_RandNumGen;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ResourceActivity {
    _unused: [u8; 0],
}
#[doc = " Resource activity data structure\n\n  - \\ref ResourceActivity \"List of all available methods\""]
pub type SCIP_RESOURCEACTIVITY = SCIP_ResourceActivity;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Profile {
    _unused: [u8; 0],
}
#[doc = " Resource profile data structure\n\n  - \\ref ResourceProfile \"List of all available methods\""]
pub type SCIP_PROFILE = SCIP_Profile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Digraph {
    _unused: [u8; 0],
}
#[doc = " Directed graph data structure (stored as adjacency list)\n\n  - \\ref DirectedGraph \"List of all available methods\""]
pub type SCIP_DIGRAPH = SCIP_Digraph;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Bt {
    _unused: [u8; 0],
}
#[doc = " Binary tree data structure\n\n  - \\ref BinaryTree \"List of all available methods\""]
pub type SCIP_BT = SCIP_Bt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BtNode {
    _unused: [u8; 0],
}
#[doc = " search node of \\ref SCIP_BT \"binary tree\""]
pub type SCIP_BTNODE = SCIP_BtNode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Regression {
    _unused: [u8; 0],
}
#[doc = " regression data structure to compute an incremental linear regression of paired observations\n\n  - \\ref Regression \"List of all available methods\""]
pub type SCIP_REGRESSION = SCIP_Regression;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DisjointSet {
    _unused: [u8; 0],
}
#[doc = " disjoint set (disjoint set (union find)) data structure for querying and updating connectedness of a graph with integer vertices 0,...,n - 1\n\n  - \\ref DisjointSet \"List of available methods\""]
pub type SCIP_DISJOINTSET = SCIP_DisjointSet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_RowPrep {
    _unused: [u8; 0],
}
#[doc = " a linear inequality row in preparation to become a SCIP_ROW\n\n Used to assemble data that could eventually make a SCIP_ROW.\n @note Only one-sided rows are allowed here."]
pub type SCIP_ROWPREP = SCIP_RowPrep;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Scip {
    _unused: [u8; 0],
}
pub type SCIP = Scip;
pub type SCIP_PRESOLTIMING = ::std::os::raw::c_uint;
pub type SCIP_PROPTIMING = ::std::os::raw::c_uint;
pub type SCIP_HEURTIMING = ::std::os::raw::c_uint;
#[doc = "< bool values: TRUE or FALSE"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_BOOL: SCIP_ParamType = 0;
#[doc = "< integer values"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_INT: SCIP_ParamType = 1;
#[doc = "< long integer values"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_LONGINT: SCIP_ParamType = 2;
#[doc = "< real values"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_REAL: SCIP_ParamType = 3;
#[doc = "< characters"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_CHAR: SCIP_ParamType = 4;
#[doc = "< strings: arrays of characters"]
pub const SCIP_ParamType_SCIP_PARAMTYPE_STRING: SCIP_ParamType = 5;
#[doc = " possible parameter types"]
pub type SCIP_ParamType = ::std::os::raw::c_uint;
#[doc = " possible parameter types"]
pub use self::SCIP_ParamType as SCIP_PARAMTYPE;
#[doc = "< use default values"]
pub const SCIP_ParamSetting_SCIP_PARAMSETTING_DEFAULT: SCIP_ParamSetting = 0;
#[doc = "< set to aggressive settings"]
pub const SCIP_ParamSetting_SCIP_PARAMSETTING_AGGRESSIVE: SCIP_ParamSetting = 1;
#[doc = "< set to fast settings"]
pub const SCIP_ParamSetting_SCIP_PARAMSETTING_FAST: SCIP_ParamSetting = 2;
#[doc = "< turn off"]
pub const SCIP_ParamSetting_SCIP_PARAMSETTING_OFF: SCIP_ParamSetting = 3;
#[doc = " possible parameter settings - used to determine the behavior of different SCIP components, e.g., heuristics, separators, ..."]
pub type SCIP_ParamSetting = ::std::os::raw::c_uint;
#[doc = " possible parameter settings - used to determine the behavior of different SCIP components, e.g., heuristics, separators, ..."]
pub use self::SCIP_ParamSetting as SCIP_PARAMSETTING;
#[doc = "< use default values"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_DEFAULT: SCIP_ParamEmphasis = 0;
#[doc = "< get CP like search (e.g. no LP relaxation)"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_CPSOLVER: SCIP_ParamEmphasis = 1;
#[doc = "< solve easy problems fast"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_EASYCIP: SCIP_ParamEmphasis = 2;
#[doc = "< detect feasibility fast"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_FEASIBILITY: SCIP_ParamEmphasis = 3;
#[doc = "< be capable to handle hard LPs"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_HARDLP: SCIP_ParamEmphasis = 4;
#[doc = "< prove optimality fast"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_OPTIMALITY: SCIP_ParamEmphasis = 5;
#[doc = "< get a feasible and \"fast\" counting process"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_COUNTER: SCIP_ParamEmphasis = 6;
#[doc = "< feasibility phase settings during 3-phase solving approach"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_PHASEFEAS: SCIP_ParamEmphasis = 7;
#[doc = "< improvement phase settings during 3-phase solving approach"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_PHASEIMPROVE: SCIP_ParamEmphasis = 8;
#[doc = "< proof phase settings during 3-phase solving approach"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_PHASEPROOF: SCIP_ParamEmphasis = 9;
#[doc = "< emphasis parameters for increased numerical safety"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_NUMERICS: SCIP_ParamEmphasis = 10;
#[doc = "< do not try to avoid running into memory limit"]
pub const SCIP_ParamEmphasis_SCIP_PARAMEMPHASIS_BENCHMARK: SCIP_ParamEmphasis = 11;
#[doc = " possible parameter emphases - used to determine the general SCIP behavior"]
pub type SCIP_ParamEmphasis = ::std::os::raw::c_uint;
#[doc = " possible parameter emphases - used to determine the general SCIP behavior"]
pub use self::SCIP_ParamEmphasis as SCIP_PARAMEMPHASIS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Param {
    _unused: [u8; 0],
}
pub type SCIP_PARAM = SCIP_Param;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ParamData {
    _unused: [u8; 0],
}
pub type SCIP_PARAMDATA = SCIP_ParamData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ParamSet {
    _unused: [u8; 0],
}
pub type SCIP_PARAMSET = SCIP_ParamSet;
unsafe extern "C" {
    pub fn imaxabs(j: intmax_t) -> intmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type SCIP_EVENTTYPE = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Eventhdlr {
    _unused: [u8; 0],
}
pub type SCIP_EVENTHDLR = SCIP_Eventhdlr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventhdlrData {
    _unused: [u8; 0],
}
pub type SCIP_EVENTHDLRDATA = SCIP_EventhdlrData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Event {
    _unused: [u8; 0],
}
pub type SCIP_EVENT = SCIP_Event;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventVarAdded {
    _unused: [u8; 0],
}
pub type SCIP_EVENTVARADDED = SCIP_EventVarAdded;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventVarDeleted {
    _unused: [u8; 0],
}
pub type SCIP_EVENTVARDELETED = SCIP_EventVarDeleted;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventVarFixed {
    _unused: [u8; 0],
}
pub type SCIP_EVENTVARFIXED = SCIP_EventVarFixed;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventVarUnlocked {
    _unused: [u8; 0],
}
pub type SCIP_EVENTVARUNLOCKED = SCIP_EventVarUnlocked;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventObjChg {
    _unused: [u8; 0],
}
pub type SCIP_EVENTOBJCHG = SCIP_EventObjChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventBdChg {
    _unused: [u8; 0],
}
pub type SCIP_EVENTBDCHG = SCIP_EventBdChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventHole {
    _unused: [u8; 0],
}
pub type SCIP_EVENTHOLE = SCIP_EventHole;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventImplAdd {
    _unused: [u8; 0],
}
pub type SCIP_EVENTIMPLADD = SCIP_EventImplAdd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventTypeChg {
    _unused: [u8; 0],
}
pub type SCIP_EVENTTYPECHG = SCIP_EventTypeChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventImplTypeChg {
    _unused: [u8; 0],
}
pub type SCIP_EVENTTYPEIMPLCHG = SCIP_EventImplTypeChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowAddedSepa {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWADDEDSEPA = SCIP_EventRowAddedSepa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowDeletedSepa {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWDELETEDSEPA = SCIP_EventRowDeletedSepa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowAddedLP {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWADDEDLP = SCIP_EventRowAddedLP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowDeletedLP {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWDELETEDLP = SCIP_EventRowDeletedLP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowCoefChanged {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWCOEFCHANGED = SCIP_EventRowCoefChanged;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowConstChanged {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWCONSTCHANGED = SCIP_EventRowConstChanged;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventRowSideChanged {
    _unused: [u8; 0],
}
pub type SCIP_EVENTROWSIDECHANGED = SCIP_EventRowSideChanged;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventData {
    _unused: [u8; 0],
}
pub type SCIP_EVENTDATA = SCIP_EventData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventFilter {
    _unused: [u8; 0],
}
pub type SCIP_EVENTFILTER = SCIP_EventFilter;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_EventQueue {
    _unused: [u8; 0],
}
pub type SCIP_EVENTQUEUE = SCIP_EventQueue;
#[doc = "< LP was not solved, no solution exists"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_NOTSOLVED: SCIP_LPSolStat = 0;
#[doc = "< LP was solved to optimality"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_OPTIMAL: SCIP_LPSolStat = 1;
#[doc = "< LP is primal infeasible"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_INFEASIBLE: SCIP_LPSolStat = 2;
#[doc = "< LP has a primal unbounded ray"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_UNBOUNDEDRAY: SCIP_LPSolStat = 3;
#[doc = "< objective limit was reached during optimization"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_OBJLIMIT: SCIP_LPSolStat = 4;
#[doc = "< iteration limit was reached during optimization"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_ITERLIMIT: SCIP_LPSolStat = 5;
#[doc = "< time limit was reached during optimization"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_TIMELIMIT: SCIP_LPSolStat = 6;
#[doc = "< an error occured during optimization"]
pub const SCIP_LPSolStat_SCIP_LPSOLSTAT_ERROR: SCIP_LPSolStat = 7;
#[doc = " solution status after solving LP"]
pub type SCIP_LPSolStat = ::std::os::raw::c_uint;
#[doc = " solution status after solving LP"]
pub use self::SCIP_LPSolStat as SCIP_LPSOLSTAT;
#[doc = "< lower bound"]
pub const SCIP_BoundType_SCIP_BOUNDTYPE_LOWER: SCIP_BoundType = 0;
#[doc = "< upper bound"]
pub const SCIP_BoundType_SCIP_BOUNDTYPE_UPPER: SCIP_BoundType = 1;
#[doc = " type of variable bound: lower or upper bound"]
pub type SCIP_BoundType = ::std::os::raw::c_uint;
#[doc = " type of variable bound: lower or upper bound"]
pub use self::SCIP_BoundType as SCIP_BOUNDTYPE;
#[doc = "< left hand side"]
pub const SCIP_SideType_SCIP_SIDETYPE_LEFT: SCIP_SideType = 0;
#[doc = "< right hand side"]
pub const SCIP_SideType_SCIP_SIDETYPE_RIGHT: SCIP_SideType = 1;
#[doc = " type of row side: left hand or right hand side"]
pub type SCIP_SideType = ::std::os::raw::c_uint;
#[doc = " type of row side: left hand or right hand side"]
pub use self::SCIP_SideType as SCIP_SIDETYPE;
#[doc = "< unspecified origin of row"]
pub const SCIP_RowOriginType_SCIP_ROWORIGINTYPE_UNSPEC: SCIP_RowOriginType = 0;
#[doc = "< row created by a constraint handler"]
pub const SCIP_RowOriginType_SCIP_ROWORIGINTYPE_CONSHDLR: SCIP_RowOriginType = 1;
#[doc = "< row created by a constraint"]
pub const SCIP_RowOriginType_SCIP_ROWORIGINTYPE_CONS: SCIP_RowOriginType = 2;
#[doc = "< row created by separator"]
pub const SCIP_RowOriginType_SCIP_ROWORIGINTYPE_SEPA: SCIP_RowOriginType = 3;
#[doc = "< row created by reoptimization"]
pub const SCIP_RowOriginType_SCIP_ROWORIGINTYPE_REOPT: SCIP_RowOriginType = 4;
#[doc = " type of origin of row"]
pub type SCIP_RowOriginType = ::std::os::raw::c_uint;
#[doc = " type of origin of row"]
pub use self::SCIP_RowOriginType as SCIP_ROWORIGINTYPE;
#[doc = "< primal simplex"]
pub const SCIP_LPAlgo_SCIP_LPALGO_PRIMALSIMPLEX: SCIP_LPAlgo = 0;
#[doc = "< dual simplex"]
pub const SCIP_LPAlgo_SCIP_LPALGO_DUALSIMPLEX: SCIP_LPAlgo = 1;
#[doc = "< barrier algorithm"]
pub const SCIP_LPAlgo_SCIP_LPALGO_BARRIER: SCIP_LPAlgo = 2;
#[doc = "< barrier algorithm with crossover"]
pub const SCIP_LPAlgo_SCIP_LPALGO_BARRIERCROSSOVER: SCIP_LPAlgo = 3;
#[doc = " type of LP algorithm"]
pub type SCIP_LPAlgo = ::std::os::raw::c_uint;
#[doc = " type of LP algorithm"]
pub use self::SCIP_LPAlgo as SCIP_LPALGO;
#[doc = " collected values of a column which depend on the LP solution\n  We store these values in each column to recover the LP solution at start of diving or probing mode, say, without\n  having to resolve the LP.  Note that we do not store the farkascoef value since we do expect a node with infeasible\n  LP to be pruned anyway."]
pub type SCIP_COLSOLVALS = SCIP_ColSolVals;
#[doc = " collected values of a row which depend on the LP solution\n  We store these values in each row to recover the LP solution at start of diving or probing mode, say, without having\n  to resolve the LP.  We do not store the dualfarkas value since we expect a node with infeasible LP to be pruned\n  anyway. In this unlikely case, we have to resolve the LP."]
pub type SCIP_ROWSOLVALS = SCIP_RowSolVals;
#[doc = " collected values of the LP data which depend on the LP solution\n  We store these values to recover the LP solution at start of diving or probing mode, say, without having to resolve\n  the LP."]
pub type SCIP_LPSOLVALS = SCIP_LpSolVals;
#[doc = " column of an LP\n\n  - \\ref PublicColumnMethods \"List of all available methods\""]
pub type SCIP_COL = SCIP_Col;
#[doc = " row of an LP\n\n  - \\ref PublicRowMethods \"List of all available methods\""]
pub type SCIP_ROW = SCIP_Row;
#[doc = " LP structure\n\n  - \\ref PublicLPMethods \"List of all available methods\""]
pub type SCIP_LP = SCIP_Lp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NlRow {
    _unused: [u8; 0],
}
pub type SCIP_NLROW = SCIP_NlRow;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Nlp {
    _unused: [u8; 0],
}
pub type SCIP_NLP = SCIP_Nlp;
#[doc = "< variable belongs to original problem"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_ORIGINAL: SCIP_Varstatus = 0;
#[doc = "< variable is a loose variable of the transformed problem"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_LOOSE: SCIP_Varstatus = 1;
#[doc = "< variable is a column of the transformed problem"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_COLUMN: SCIP_Varstatus = 2;
#[doc = "< variable is fixed to specific value in the transformed problem"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_FIXED: SCIP_Varstatus = 3;
#[doc = "< variable is aggregated to x = a*y + c in the transformed problem"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_AGGREGATED: SCIP_Varstatus = 4;
#[doc = "< variable is aggregated to x = a_1*y_1 + ... + a_k*y_k + c"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_MULTAGGR: SCIP_Varstatus = 5;
#[doc = "< variable is the negation of an original or transformed variable"]
pub const SCIP_Varstatus_SCIP_VARSTATUS_NEGATED: SCIP_Varstatus = 6;
#[doc = " status of problem variables"]
pub type SCIP_Varstatus = ::std::os::raw::c_uint;
#[doc = " status of problem variables"]
pub use self::SCIP_Varstatus as SCIP_VARSTATUS;
#[doc = "< binary variable: \\f$ x \\in \\{0,1\\} \\f$"]
pub const SCIP_Vartype_SCIP_VARTYPE_BINARY: SCIP_Vartype = 0;
#[doc = "< integer variable: \\f$ x \\in \\{lb, \\dots, ub\\} \\f$"]
pub const SCIP_Vartype_SCIP_VARTYPE_INTEGER: SCIP_Vartype = 1;
#[doc = "< @deprecated use `SCIPcreateVarImpl()` or `SCIPvarChgImplType()` to control implied integrality"]
pub const SCIP_Vartype_SCIP_VARTYPE_IMPLINT: SCIP_Vartype = 2;
#[doc = "< continuous variable: \\f$ lb \\leq x \\leq ub \\f$"]
pub const SCIP_Vartype_SCIP_VARTYPE_CONTINUOUS: SCIP_Vartype = 3;
#[doc = " variable type"]
pub type SCIP_Vartype = ::std::os::raw::c_uint;
#[doc = " variable type"]
pub use self::SCIP_Vartype as SCIP_VARTYPE;
#[doc = "< The variable is not implied integral by other variables"]
pub const SCIP_ImplintType_SCIP_IMPLINTTYPE_NONE: SCIP_ImplintType = 0;
#[doc = "< The constraint handlers enforce that if the problem is relaxed\n   to have integrality constraints for the non-implied integral variables\n   only, there exists an optimal solution where all weakly and strongly\n   implied integral variables have integer solution values.\n   For infeasible problems, when relaxing integrality of all implied\n   integer variables, the problem remains infeasible.\n   For unbounded problems, when enforcing integrality of all implied\n   integer variables, the problem remains unbounded.\n\n   @note This notion of implied integrality is fragile and may break\n   if extra constraints are added.\n\n   Example: The variable z is a weakly implied integral if it only occurs\n   in the constraint 4x + 3y + z <= 10, where x and y are integer and\n   z has objective 0."]
pub const SCIP_ImplintType_SCIP_IMPLINTTYPE_WEAK: SCIP_ImplintType = 1;
#[doc = "< The constraint handlers enforce that if the problem is relaxed\n   to have integrality constraints for the non-implied integral variables\n   only, in every feasible solution all strongly implied integral\n   variables have integer solution values.\n\n   @note This notion of implied integrality remains intact under the\n   addition of additional constraints to the problem.\n\n   Example: The variable z is strongly implied integral if we have the\n   constraint: 4x + 3y + z = 10, where x and y are integer variables."]
pub const SCIP_ImplintType_SCIP_IMPLINTTYPE_STRONG: SCIP_ImplintType = 2;
#[doc = " implied integral type"]
pub type SCIP_ImplintType = ::std::os::raw::c_uint;
#[doc = " implied integral type"]
pub use self::SCIP_ImplintType as SCIP_IMPLINTTYPE;
#[doc = "< dynamic bound changes with size information of arrays"]
pub const SCIP_DomchgType_SCIP_DOMCHGTYPE_DYNAMIC: SCIP_DomchgType = 0;
#[doc = "< static domain changes: number of entries equals size of arrays"]
pub const SCIP_DomchgType_SCIP_DOMCHGTYPE_BOTH: SCIP_DomchgType = 1;
#[doc = "< static domain changes without any hole changes"]
pub const SCIP_DomchgType_SCIP_DOMCHGTYPE_BOUND: SCIP_DomchgType = 2;
#[doc = " domain change data type"]
pub type SCIP_DomchgType = ::std::os::raw::c_uint;
#[doc = " domain change data type"]
pub use self::SCIP_DomchgType as SCIP_DOMCHGTYPE;
#[doc = "< bound change was due to a branching decision"]
pub const SCIP_BoundchgType_SCIP_BOUNDCHGTYPE_BRANCHING: SCIP_BoundchgType = 0;
#[doc = "< bound change was due to an inference of a constraint (domain propagation)"]
pub const SCIP_BoundchgType_SCIP_BOUNDCHGTYPE_CONSINFER: SCIP_BoundchgType = 1;
#[doc = "< bound change was due to an inference of a domain propagator"]
pub const SCIP_BoundchgType_SCIP_BOUNDCHGTYPE_PROPINFER: SCIP_BoundchgType = 2;
#[doc = " bound change type"]
pub type SCIP_BoundchgType = ::std::os::raw::c_uint;
#[doc = " bound change type"]
pub use self::SCIP_BoundchgType as SCIP_BOUNDCHGTYPE;
#[doc = "< variable locks for model and check constraints"]
pub const SCIP_LockType_SCIP_LOCKTYPE_MODEL: SCIP_LockType = 0;
#[doc = "< variable locks for conflict constraints"]
pub const SCIP_LockType_SCIP_LOCKTYPE_CONFLICT: SCIP_LockType = 1;
pub type SCIP_LockType = ::std::os::raw::c_uint;
pub use self::SCIP_LockType as SCIP_LOCKTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DomChgBound {
    _unused: [u8; 0],
}
pub type SCIP_DOMCHGBOUND = SCIP_DomChgBound;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DomChgBoth {
    _unused: [u8; 0],
}
pub type SCIP_DOMCHGBOTH = SCIP_DomChgBoth;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DomChgDyn {
    _unused: [u8; 0],
}
pub type SCIP_DOMCHGDYN = SCIP_DomChgDyn;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct SCIP_DomChg {
    _unused: [u8; 0],
}
pub type SCIP_DOMCHG = SCIP_DomChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BoundChg {
    _unused: [u8; 0],
}
pub type SCIP_BOUNDCHG = SCIP_BoundChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BdChgIdx {
    _unused: [u8; 0],
}
pub type SCIP_BDCHGIDX = SCIP_BdChgIdx;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BdChgInfo {
    _unused: [u8; 0],
}
pub type SCIP_BDCHGINFO = SCIP_BdChgInfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BranchingData {
    _unused: [u8; 0],
}
pub type SCIP_BRANCHINGDATA = SCIP_BranchingData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_InferenceData {
    _unused: [u8; 0],
}
pub type SCIP_INFERENCEDATA = SCIP_InferenceData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HoleChg {
    _unused: [u8; 0],
}
pub type SCIP_HOLECHG = SCIP_HoleChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Hole {
    _unused: [u8; 0],
}
pub type SCIP_HOLE = SCIP_Hole;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Holelist {
    _unused: [u8; 0],
}
pub type SCIP_HOLELIST = SCIP_Holelist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Dom {
    _unused: [u8; 0],
}
pub type SCIP_DOM = SCIP_Dom;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Original {
    _unused: [u8; 0],
}
pub type SCIP_ORIGINAL = SCIP_Original;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Loose {
    _unused: [u8; 0],
}
pub type SCIP_LOOSE = SCIP_Loose;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Aggregate {
    _unused: [u8; 0],
}
pub type SCIP_AGGREGATE = SCIP_Aggregate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_AggregateExact {
    _unused: [u8; 0],
}
pub type SCIP_AGGREGATEEXACT = SCIP_AggregateExact;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Multaggr {
    _unused: [u8; 0],
}
pub type SCIP_MULTAGGR = SCIP_Multaggr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_MultaggrExact {
    _unused: [u8; 0],
}
pub type SCIP_MULTAGGREXACT = SCIP_MultaggrExact;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Negate {
    _unused: [u8; 0],
}
pub type SCIP_NEGATE = SCIP_Negate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Var {
    _unused: [u8; 0],
}
pub type SCIP_VAR = SCIP_Var;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_VarData {
    _unused: [u8; 0],
}
pub type SCIP_VARDATA = SCIP_VarData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_VarDataExact {
    _unused: [u8; 0],
}
pub type SCIP_VARDATAEXACT = SCIP_VarDataExact;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DomExact {
    _unused: [u8; 0],
}
pub type SCIP_DOMEXACT = SCIP_DomExact;
#[doc = "< maximization of objective function"]
pub const SCIP_Objsense_SCIP_OBJSENSE_MAXIMIZE: SCIP_Objsense = -1;
#[doc = "< minimization of objective function (the default)"]
pub const SCIP_Objsense_SCIP_OBJSENSE_MINIMIZE: SCIP_Objsense = 1;
#[doc = " objective sense: minimization or maximization"]
pub type SCIP_Objsense = ::std::os::raw::c_int;
#[doc = " objective sense: minimization or maximization"]
pub use self::SCIP_Objsense as SCIP_OBJSENSE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Prob {
    _unused: [u8; 0],
}
pub type SCIP_PROB = SCIP_Prob;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ProbData {
    _unused: [u8; 0],
}
pub type SCIP_PROBDATA = SCIP_ProbData;
#[doc = "< the focus node, whose data is stored in the tree data structure"]
pub const SCIP_NodeType_SCIP_NODETYPE_FOCUSNODE: SCIP_NodeType = 0;
#[doc = "< temporary child node of the focus or refocused node used for probing"]
pub const SCIP_NodeType_SCIP_NODETYPE_PROBINGNODE: SCIP_NodeType = 1;
#[doc = "< unsolved sibling of the focus node"]
pub const SCIP_NodeType_SCIP_NODETYPE_SIBLING: SCIP_NodeType = 2;
#[doc = "< unsolved child of the focus node"]
pub const SCIP_NodeType_SCIP_NODETYPE_CHILD: SCIP_NodeType = 3;
#[doc = "< unsolved leaf of the tree, stored in the tree's queue"]
pub const SCIP_NodeType_SCIP_NODETYPE_LEAF: SCIP_NodeType = 4;
#[doc = "< temporary type of focus node, if it was solved completely"]
pub const SCIP_NodeType_SCIP_NODETYPE_DEADEND: SCIP_NodeType = 5;
#[doc = "< fork without LP solution"]
pub const SCIP_NodeType_SCIP_NODETYPE_JUNCTION: SCIP_NodeType = 6;
#[doc = "< fork without LP solution and added rows and columns"]
pub const SCIP_NodeType_SCIP_NODETYPE_PSEUDOFORK: SCIP_NodeType = 7;
#[doc = "< fork with solved LP and added rows and columns"]
pub const SCIP_NodeType_SCIP_NODETYPE_FORK: SCIP_NodeType = 8;
#[doc = "< fork with solved LP and arbitrarily changed rows and columns"]
pub const SCIP_NodeType_SCIP_NODETYPE_SUBROOT: SCIP_NodeType = 9;
#[doc = "< junction, fork, or subroot that was refocused for domain propagation"]
pub const SCIP_NodeType_SCIP_NODETYPE_REFOCUSNODE: SCIP_NodeType = 10;
pub type SCIP_NodeType = ::std::os::raw::c_uint;
pub use self::SCIP_NodeType as SCIP_NODETYPE;
#[doc = " probing node, possibly with solved LP, where bounds and constraints have been changed,\n  and rows and columns might have been added"]
pub type SCIP_PROBINGNODE = SCIP_Probingnode;
#[doc = " sibling information (should not exceed the size of a pointer)"]
pub type SCIP_SIBLING = SCIP_Sibling;
#[doc = " child information (should not exceed the size of a pointer)"]
pub type SCIP_CHILD = SCIP_Child;
#[doc = " leaf information (should not exceed the size of a pointer)"]
pub type SCIP_LEAF = SCIP_Leaf;
#[doc = " fork without LP solution, where only bounds and constraints have been changed"]
pub type SCIP_JUNCTION = SCIP_Junction;
#[doc = " fork without LP solution, where bounds and constraints have been changed, and rows and columns were added"]
pub type SCIP_PSEUDOFORK = SCIP_Pseudofork;
#[doc = " fork with solved LP, where bounds and constraints have been changed, and rows and columns were added"]
pub type SCIP_FORK = SCIP_Fork;
#[doc = " fork with solved LP, where bounds and constraints have been changed, and rows and columns were removed and added"]
pub type SCIP_SUBROOT = SCIP_Subroot;
#[doc = " node data structure"]
pub type SCIP_NODE = SCIP_Node;
#[doc = " bound change information for pending bound changes"]
pub type SCIP_PENDINGBDCHG = SCIP_PendingBdchg;
#[doc = " branch and bound tree"]
pub type SCIP_TREE = SCIP_Tree;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Bandit {
    _unused: [u8; 0],
}
#[doc = " data structure for bandit algorithms"]
pub type SCIP_BANDIT = SCIP_Bandit;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BanditVTable {
    _unused: [u8; 0],
}
#[doc = " virtual function table for bandit callbacks"]
pub type SCIP_BANDITVTABLE = SCIP_BanditVTable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BanditData {
    _unused: [u8; 0],
}
#[doc = " data structure for specific bandit algorithm implementation"]
pub type SCIP_BANDITDATA = SCIP_BanditData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BranchCand {
    _unused: [u8; 0],
}
pub type SCIP_BRANCHCAND = SCIP_BranchCand;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Branchrule {
    _unused: [u8; 0],
}
pub type SCIP_BRANCHRULE = SCIP_Branchrule;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BranchruleData {
    _unused: [u8; 0],
}
pub type SCIP_BRANCHRULEDATA = SCIP_BranchruleData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Treemodel {
    _unused: [u8; 0],
}
pub type SCIP_TREEMODEL = SCIP_Treemodel;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Conflicthdlr {
    _unused: [u8; 0],
}
pub type SCIP_CONFLICTHDLR = SCIP_Conflicthdlr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConflicthdlrData {
    _unused: [u8; 0],
}
pub type SCIP_CONFLICTHDLRDATA = SCIP_ConflicthdlrData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConflictSet {
    _unused: [u8; 0],
}
pub type SCIP_CONFLICTSET = SCIP_ConflictSet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ProofSet {
    _unused: [u8; 0],
}
pub type SCIP_PROOFSET = SCIP_ProofSet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConflictRow {
    _unused: [u8; 0],
}
pub type SCIP_CONFLICTROW = SCIP_ConflictRow;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_LPBdChgs {
    _unused: [u8; 0],
}
pub type SCIP_LPBDCHGS = SCIP_LPBdChgs;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Conflict {
    _unused: [u8; 0],
}
pub type SCIP_CONFLICT = SCIP_Conflict;
#[doc = "< unknown type"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_UNKNOWN: SCIP_ConflictType = 0;
#[doc = "< conflict results from propagation"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_PROPAGATION: SCIP_ConflictType = 1;
#[doc = "< conflict results from an infeasible LP relaxation"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_INFEASLP: SCIP_ConflictType = 2;
#[doc = "< conflict results from a boundexceeding LP relaxation"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_BNDEXCEEDING: SCIP_ConflictType = 3;
#[doc = "< alternative proof of an infeasible LP relaxation"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_ALTINFPROOF: SCIP_ConflictType = 4;
#[doc = "< alternative proof of a boundexceeding LP relaxation"]
pub const SCIP_ConflictType_SCIP_CONFTYPE_ALTBNDPROOF: SCIP_ConflictType = 5;
#[doc = " types of conflicts"]
pub type SCIP_ConflictType = ::std::os::raw::c_uint;
#[doc = " types of conflicts"]
pub use self::SCIP_ConflictType as SCIP_CONFTYPE;
#[doc = "< no presolving"]
pub const SCIP_ConflictPresolStrat_SCIP_CONFPRES_DISABLED: SCIP_ConflictPresolStrat = 0;
#[doc = "< keep variables contributing with its local bound"]
pub const SCIP_ConflictPresolStrat_SCIP_CONFPRES_ONLYLOCAL: SCIP_ConflictPresolStrat = 1;
#[doc = "< keep variables contributing with its global bound"]
pub const SCIP_ConflictPresolStrat_SCIP_CONFPRES_ONLYGLOBAL: SCIP_ConflictPresolStrat = 2;
#[doc = "< keep variables contributing with its global bound and add a few\n   variables contributing with its local bound such that the\n   constraint is not globally redundant"]
pub const SCIP_ConflictPresolStrat_SCIP_CONFPRES_BOTH: SCIP_ConflictPresolStrat = 3;
#[doc = " dualray presolving strategy"]
pub type SCIP_ConflictPresolStrat = ::std::os::raw::c_uint;
#[doc = " dualray presolving strategy"]
pub use self::SCIP_ConflictPresolStrat as SCIP_CONFPRES;
#[doc = "< solution describes original variables; non-cached elements are zero"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_ORIGINAL: SCIP_SolOrigin = 0;
#[doc = "< all non-cached elements in solution are equal to zero"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_ZERO: SCIP_SolOrigin = 1;
#[doc = "< all non-cached elements in solution are equal to current LP solution"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_LPSOL: SCIP_SolOrigin = 2;
#[doc = "< all non-cached elements in solution are equal to current NLP solution"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_NLPSOL: SCIP_SolOrigin = 3;
#[doc = "< all non-cached elements in solution are equal to current relaxation solution"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_RELAXSOL: SCIP_SolOrigin = 4;
#[doc = "< all non-cached elements in solution are equal to current pseudo solution"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_PSEUDOSOL: SCIP_SolOrigin = 5;
#[doc = "< solution describes original solution; all non-cached elements in solution\n   are treated as being an arbitrary value in the variable's bounds"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_PARTIAL: SCIP_SolOrigin = 6;
#[doc = "< all non-cached elements in solution are unknown; they have to be treated\n   as being an arbitrary value in the variable's bounds"]
pub const SCIP_SolOrigin_SCIP_SOLORIGIN_UNKNOWN: SCIP_SolOrigin = 7;
#[doc = " origin of solution: where to retrieve uncached elements"]
pub type SCIP_SolOrigin = ::std::os::raw::c_uint;
#[doc = " origin of solution: where to retrieve uncached elements"]
pub use self::SCIP_SolOrigin as SCIP_SOLORIGIN;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Sol {
    _unused: [u8; 0],
}
pub type SCIP_SOL = SCIP_Sol;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Viol {
    _unused: [u8; 0],
}
pub type SCIP_VIOL = SCIP_Viol;
#[doc = "< type of solution unspecified (the default)"]
pub const SCIP_SolType_SCIP_SOLTYPE_UNKNOWN: SCIP_SolType = 0;
#[doc = "< solution was found by a heuristic"]
pub const SCIP_SolType_SCIP_SOLTYPE_HEUR: SCIP_SolType = 1;
#[doc = "< solution was found by a relaxation"]
pub const SCIP_SolType_SCIP_SOLTYPE_RELAX: SCIP_SolType = 2;
#[doc = "< solution was found by the LP relaxation"]
pub const SCIP_SolType_SCIP_SOLTYPE_LPRELAX: SCIP_SolType = 3;
#[doc = "< solution was found during strong branching"]
pub const SCIP_SolType_SCIP_SOLTYPE_STRONGBRANCH: SCIP_SolType = 4;
#[doc = "< solution originates from a pseudo solution"]
pub const SCIP_SolType_SCIP_SOLTYPE_PSEUDO: SCIP_SolType = 5;
#[doc = " type of solution: heuristic or (LP) relaxation solution, or unspecified origin"]
pub type SCIP_SolType = ::std::os::raw::c_uint;
#[doc = " type of solution: heuristic or (LP) relaxation solution, or unspecified origin"]
pub use self::SCIP_SolType as SCIP_SOLTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ValsExact {
    _unused: [u8; 0],
}
pub type SCIP_VALSEXACT = SCIP_ValsExact;
pub type SCIP_DIVETYPE = ::std::os::raw::c_uint;
#[doc = "< all contexts combined"]
pub const SCIP_DiveContext_SCIP_DIVECONTEXT_TOTAL: SCIP_DiveContext = 0;
#[doc = "< single heuristic context"]
pub const SCIP_DiveContext_SCIP_DIVECONTEXT_SINGLE: SCIP_DiveContext = 1;
#[doc = "< within adaptive diving"]
pub const SCIP_DiveContext_SCIP_DIVECONTEXT_ADAPTIVE: SCIP_DiveContext = 2;
#[doc = "< within the scheduler heuristic"]
pub const SCIP_DiveContext_SCIP_DIVECONTEXT_SCHEDULER: SCIP_DiveContext = 3;
#[doc = " context for diving statistics"]
pub type SCIP_DiveContext = ::std::os::raw::c_uint;
#[doc = " context for diving statistics"]
pub use self::SCIP_DiveContext as SCIP_DIVECONTEXT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Heur {
    _unused: [u8; 0],
}
pub type SCIP_HEUR = SCIP_Heur;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_HeurData {
    _unused: [u8; 0],
}
pub type SCIP_HEURDATA = SCIP_HeurData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Diveset {
    _unused: [u8; 0],
}
pub type SCIP_DIVESET = SCIP_Diveset;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_VGraph {
    _unused: [u8; 0],
}
pub type SCIP_VGRAPH = SCIP_VGraph;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Conshdlr {
    _unused: [u8; 0],
}
pub type SCIP_CONSHDLR = SCIP_Conshdlr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Cons {
    _unused: [u8; 0],
}
pub type SCIP_CONS = SCIP_Cons;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConshdlrData {
    _unused: [u8; 0],
}
pub type SCIP_CONSHDLRDATA = SCIP_ConshdlrData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConsData {
    _unused: [u8; 0],
}
pub type SCIP_CONSDATA = SCIP_ConsData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConsSetChg {
    _unused: [u8; 0],
}
pub type SCIP_CONSSETCHG = SCIP_ConsSetChg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_LinConsStats {
    _unused: [u8; 0],
}
pub type SCIP_LINCONSSTATS = SCIP_LinConsStats;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SYM_Graph {
    _unused: [u8; 0],
}
pub type SYM_GRAPH = SYM_Graph;
#[doc = "< linear constraints with no variables"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_EMPTY: SCIP_LinConstype = 0;
#[doc = "< linear constraints with no finite side"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_FREE: SCIP_LinConstype = 1;
#[doc = "< linear constraints with a single variable"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_SINGLETON: SCIP_LinConstype = 2;
#[doc = "< linear constraints of the type \\f$ ax + by = c\\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_AGGREGATION: SCIP_LinConstype = 3;
#[doc = "< linear constraints of the type \\f$ a x - a y \\leq b\\f$ where \\f$x\\f$ and \\f$y\\f$ must have the same type"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_PRECEDENCE: SCIP_LinConstype = 4;
#[doc = "< linear constraints of the form \\f$ ax + by \\leq c \\, x \\in \\{0,1\\} \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_VARBOUND: SCIP_LinConstype = 5;
#[doc = "< linear constraints of the form \\f$ \\sum x_i = 1\\, x_i \\in \\{0,1\\} \\forall i \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_SETPARTITION: SCIP_LinConstype = 6;
#[doc = "< linear constraints of the form \\f$ \\sum x_i \\leq 1\\, x_i \\in \\{0,1\\} \\forall i \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_SETPACKING: SCIP_LinConstype = 7;
#[doc = "< linear constraints of the form \\f$ \\sum x_i \\geq 1\\, x_i \\in \\{0,1\\} \\forall i \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_SETCOVERING: SCIP_LinConstype = 8;
#[doc = "< linear constraints of the form \\f$ \\sum x_i = k\\, x_i \\in \\{0,1\\} \\forall i, \\, k\\geq 2 \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_CARDINALITY: SCIP_LinConstype = 9;
#[doc = "< linear constraints of the form \\f$ \\sum x_i \\leq b\\, x_i \\in \\{0,1\\} \\forall i, \\, b\\in \\mathbb{n} \\geq 2 \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_INVKNAPSACK: SCIP_LinConstype = 10;
#[doc = "< linear constraints of the form \\f$ \\sum a_i x_i = b\\, x_i \\in \\{0,1\\} \\forall i, \\, b\\in \\mathbb{n} \\geq 2 \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_EQKNAPSACK: SCIP_LinConstype = 11;
#[doc = "< linear constraints of the form \\f$ \\sum a_i x_i + a x \\leq a\\, x, x_i \\in \\{0,1\\} \\forall i, \\, a\\in \\mathbb{n} \\geq 2 \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_BINPACKING: SCIP_LinConstype = 12;
#[doc = "< linear constraints of the form \\f$ \\sum a_k x_k \\leq b\\, x_i \\in \\{0,1\\} \\forall i, \\, b\\in \\mathbb{n} \\geq 2 \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_KNAPSACK: SCIP_LinConstype = 13;
#[doc = "< linear constraints of the form \\f$ \\sum a_k x_k \\leq b\\, x_i \\in \\mathbb{Z} \\forall i, \\, b\\in \\mathbb{n} \\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_INTKNAPSACK: SCIP_LinConstype = 14;
#[doc = "< linear constraints of the form \\f$ \\sum a_k x_k + \\sum p_j s_j \\leq/= b\\, x_i \\in \\{0,1\\} \\forall i, s_j \\in \\text{ cont. } \\forall j\\f$"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_MIXEDBINARY: SCIP_LinConstype = 15;
#[doc = "< general linear constraints with no special structure"]
pub const SCIP_LinConstype_SCIP_LINCONSTYPE_GENERAL: SCIP_LinConstype = 16;
#[doc = " linear constraint types recognizable"]
pub type SCIP_LinConstype = ::std::os::raw::c_uint;
#[doc = " linear constraint types recognizable"]
pub use self::SCIP_LinConstype as SCIP_LINCONSTYPE;
#[doc = "< a SCIP_Bool value"]
pub const SCIP_Datatree_Valuetype_SCIP_DATATREE_BOOL: SCIP_Datatree_Valuetype = 0;
#[doc = "< a SCIP_Longint integer value"]
pub const SCIP_Datatree_Valuetype_SCIP_DATATREE_LONG: SCIP_Datatree_Valuetype = 1;
#[doc = "< a SCIP_Real floating point value"]
pub const SCIP_Datatree_Valuetype_SCIP_DATATREE_REAL: SCIP_Datatree_Valuetype = 2;
#[doc = "< a C string"]
pub const SCIP_Datatree_Valuetype_SCIP_DATATREE_STRING: SCIP_Datatree_Valuetype = 3;
#[doc = "< an array of SCIP_Bool values"]
pub const SCIP_Datatree_Valuetype_SCIP_DATATREE_BOOLARRAY: SCIP_Datatree_Valuetype = 4;
#[doc = "< an array of SCIP_Longint values"]
pub const SCIP_Datatree_Valuetype_SCIP_DATATREE_LONGARRAY: SCIP_Datatree_Valuetype = 5;
#[doc = "< an array of SCIP_Real values"]
pub const SCIP_Datatree_Valuetype_SCIP_DATATREE_REALARRAY: SCIP_Datatree_Valuetype = 6;
#[doc = "< an array of C strings"]
pub const SCIP_Datatree_Valuetype_SCIP_DATATREE_STRINGARRAY: SCIP_Datatree_Valuetype = 7;
#[doc = "< a SCIP_DATATREE object"]
pub const SCIP_Datatree_Valuetype_SCIP_DATATREE_DATATREE: SCIP_Datatree_Valuetype = 8;
#[doc = " type of values stored in a SCIP_DATATREE"]
pub type SCIP_Datatree_Valuetype = ::std::os::raw::c_uint;
#[doc = " type of values stored in a SCIP_DATATREE"]
pub use self::SCIP_Datatree_Valuetype as SCIP_DATATREE_VALUETYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Datatree {
    _unused: [u8; 0],
}
#[doc = " generic hierarchical data storage"]
pub type SCIP_DATATREE = SCIP_Datatree;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Dialog {
    _unused: [u8; 0],
}
pub type SCIP_DIALOG = SCIP_Dialog;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DialogData {
    _unused: [u8; 0],
}
pub type SCIP_DIALOGDATA = SCIP_DialogData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Dialoghdlr {
    _unused: [u8; 0],
}
pub type SCIP_DIALOGHDLR = SCIP_Dialoghdlr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Linelist {
    _unused: [u8; 0],
}
pub type SCIP_LINELIST = SCIP_Linelist;
#[doc = "< display column is not displayed"]
pub const SCIP_DispStatus_SCIP_DISPSTATUS_OFF: SCIP_DispStatus = 0;
#[doc = "< display column is switched on and off automatically"]
pub const SCIP_DispStatus_SCIP_DISPSTATUS_AUTO: SCIP_DispStatus = 1;
#[doc = "< display column is displayed"]
pub const SCIP_DispStatus_SCIP_DISPSTATUS_ON: SCIP_DispStatus = 2;
#[doc = " display activation status of display column"]
pub type SCIP_DispStatus = ::std::os::raw::c_uint;
#[doc = " display activation status of display column"]
pub use self::SCIP_DispStatus as SCIP_DISPSTATUS;
#[doc = "< display column is displayed only in sequential mode"]
pub const SCIP_DispMode_SCIP_DISPMODE_DEFAULT: SCIP_DispMode = 1;
#[doc = "< display column is displayed only in concurrent mode"]
pub const SCIP_DispMode_SCIP_DISPMODE_CONCURRENT: SCIP_DispMode = 2;
#[doc = "< display column is displayed in concurrent and sequential mode"]
pub const SCIP_DispMode_SCIP_DISPMODE_ALL: SCIP_DispMode = 3;
#[doc = " display activation status of display column"]
pub type SCIP_DispMode = ::std::os::raw::c_uint;
#[doc = " display activation status of display column"]
pub use self::SCIP_DispMode as SCIP_DISPMODE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Disp {
    _unused: [u8; 0],
}
pub type SCIP_DISP = SCIP_Disp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_DispData {
    _unused: [u8; 0],
}
pub type SCIP_DISPDATA = SCIP_DispData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Rational {
    _unused: [u8; 0],
}
#[doc = " type used for rational numbers"]
pub type SCIP_RATIONAL = SCIP_Rational;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_RationalArray {
    _unused: [u8; 0],
}
#[doc = " dynamic array for storing SCIP_Real values"]
pub type SCIP_RATIONALARRAY = SCIP_RationalArray;
#[doc = "< representability is unknown"]
pub const SCIP_IsFpRepresentable_SCIP_ISFPREPRESENTABLE_UNKNOWN: SCIP_IsFpRepresentable = 0;
#[doc = "< is representable"]
pub const SCIP_IsFpRepresentable_SCIP_ISFPREPRESENTABLE_TRUE: SCIP_IsFpRepresentable = 1;
#[doc = "< is not representable"]
pub const SCIP_IsFpRepresentable_SCIP_ISFPREPRESENTABLE_FALSE: SCIP_IsFpRepresentable = 2;
#[doc = " information if a rational is exactly representable as a floating point number"]
pub type SCIP_IsFpRepresentable = ::std::os::raw::c_uint;
#[doc = " information if a rational is exactly representable as a floating point number"]
pub use self::SCIP_IsFpRepresentable as SCIP_ISFPREPRESENTABLE;
#[doc = "< always round to nearest smaller double"]
pub const SCIP_RoundModeRational_SCIP_R_ROUND_DOWNWARDS: SCIP_RoundModeRational = 0;
#[doc = "< always round to nearest larger double"]
pub const SCIP_RoundModeRational_SCIP_R_ROUND_UPWARDS: SCIP_RoundModeRational = 1;
#[doc = "< always round to nearest double"]
pub const SCIP_RoundModeRational_SCIP_R_ROUND_NEAREST: SCIP_RoundModeRational = 2;
#[doc = " defines the possible rounding direction for a rational number, when converting to a double"]
pub type SCIP_RoundModeRational = ::std::os::raw::c_uint;
#[doc = " defines the possible rounding direction for a rational number, when converting to a double"]
pub use self::SCIP_RoundModeRational as SCIP_ROUNDMODE_RAT;
#[doc = " interval given by infimum and supremum"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Interval {
    #[doc = "< infimum (lower bound) of interval"]
    pub inf: f64,
    #[doc = "< supremum (upper bound) of interval"]
    pub sup: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCIP_Interval"][::std::mem::size_of::<SCIP_Interval>() - 16usize];
    ["Alignment of SCIP_Interval"][::std::mem::align_of::<SCIP_Interval>() - 8usize];
    ["Offset of field: SCIP_Interval::inf"][::std::mem::offset_of!(SCIP_Interval, inf) - 0usize];
    ["Offset of field: SCIP_Interval::sup"][::std::mem::offset_of!(SCIP_Interval, sup) - 8usize];
};
#[doc = " interval given by infimum and supremum"]
pub type SCIP_INTERVAL = SCIP_Interval;
#[doc = " rounding mode of floating point operations (upwards, downwards, nearest, ...)\n\n exact values depend on machine and compiler"]
pub type SCIP_ROUNDMODE = ::std::os::raw::c_int;
unsafe extern "C" {
    #[doc = " returns whether rounding mode control is available"]
    pub fn SCIPintervalHasRoundingControl() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " sets rounding mode of floating point operations"]
    pub fn SCIPintervalSetRoundingMode(roundmode: SCIP_ROUNDMODE);
}
unsafe extern "C" {
    #[doc = " gets current rounding mode of floating point operations"]
    pub fn SCIPintervalGetRoundingMode() -> SCIP_ROUNDMODE;
}
unsafe extern "C" {
    #[doc = " sets rounding mode of floating point operations to downwards rounding"]
    pub fn SCIPintervalSetRoundingModeDownwards();
}
unsafe extern "C" {
    #[doc = " sets rounding mode of floating point operations to upwards rounding"]
    pub fn SCIPintervalSetRoundingModeUpwards();
}
unsafe extern "C" {
    #[doc = " sets rounding mode of floating point operations to nearest rounding"]
    pub fn SCIPintervalSetRoundingModeToNearest();
}
unsafe extern "C" {
    #[doc = " sets rounding mode of floating point operations to towards zero rounding"]
    pub fn SCIPintervalSetRoundingModeTowardsZero();
}
unsafe extern "C" {
    #[doc = " negates a number in a way that the compiler does not optimize it away"]
    pub fn SCIPintervalNegateReal(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " returns infimum of interval"]
    pub fn SCIPintervalGetInf(interval: SCIP_INTERVAL) -> f64;
}
unsafe extern "C" {
    #[doc = " returns supremum of interval"]
    pub fn SCIPintervalGetSup(interval: SCIP_INTERVAL) -> f64;
}
unsafe extern "C" {
    #[doc = " stores given value as interval"]
    pub fn SCIPintervalSet(resultant: *mut SCIP_INTERVAL, value: f64);
}
unsafe extern "C" {
    #[doc = " stores given value as interval"]
    pub fn SCIPintervalSetRational(resultant: *mut SCIP_INTERVAL, value: *mut SCIP_RATIONAL);
}
unsafe extern "C" {
    #[doc = " stores given infimum and supremum as interval"]
    pub fn SCIPintervalSetBounds(resultant: *mut SCIP_INTERVAL, inf: f64, sup: f64);
}
unsafe extern "C" {
    #[doc = " sets interval to empty interval, which will be [1.0, -1.0]"]
    pub fn SCIPintervalSetEmpty(resultant: *mut SCIP_INTERVAL);
}
unsafe extern "C" {
    #[doc = " indicates whether interval is empty, i.e., whether inf > sup"]
    pub fn SCIPintervalIsEmpty(infinity: f64, operand: SCIP_INTERVAL) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " sets interval to entire [-infinity, +infinity]"]
    pub fn SCIPintervalSetEntire(infinity: f64, resultant: *mut SCIP_INTERVAL);
}
unsafe extern "C" {
    #[doc = " indicates whether interval is entire, i.e., whether inf &le; -infinity and sup &ge; infinity"]
    pub fn SCIPintervalIsEntire(infinity: f64, operand: SCIP_INTERVAL) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " indicates whether interval is positive infinity, i.e., [infinity, infinity]"]
    pub fn SCIPintervalIsPositiveInfinity(
        infinity: f64,
        operand: SCIP_INTERVAL,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " indicates whether interval is negative infinity, i.e., [-infinity, -infinity]"]
    pub fn SCIPintervalIsNegativeInfinity(
        infinity: f64,
        operand: SCIP_INTERVAL,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " indicates whether operand1 is contained in operand2"]
    pub fn SCIPintervalIsSubsetEQ(
        infinity: f64,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " indicates whether operand1 and operand2 are disjoint"]
    pub fn SCIPintervalAreDisjoint(
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " indicates whether operand1 and operand2 are disjoint with epsilon tolerance\n\n Returns whether minimal (relative) distance of intervals is larger than epsilon.\n Same as `SCIPintervalIsEmpty(SCIPintervalIntersectEps(operand1, operand2))`."]
    pub fn SCIPintervalAreDisjointEps(
        eps: f64,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " intersection of two intervals"]
    pub fn SCIPintervalIntersect(
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " intersection of two intervals with epsilon tolerance\n\n If intersection of operand1 and operand2 is empty, but minimal (relative) distance of intervals\n is at most epsilon, then set resultant to singleton containing the point in operand1\n that is closest to operand2, i.e.,\n - `resultant = { operand1.sup }`, if `operand1.sup` < `operand2.inf` and `reldiff(operand2.inf,operand1.sup)` &le; eps\n - `resultant = { operand1.inf }`, if `operand1.inf` > `operand2.sup` and `reldiff(operand1.inf,operand2.sup)` &le; eps\n - `resultant` = intersection of `operand1` and `operand2`, otherwise"]
    pub fn SCIPintervalIntersectEps(
        resultant: *mut SCIP_INTERVAL,
        eps: f64,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " interval enclosure of the union of two intervals"]
    pub fn SCIPintervalUnify(
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " adds operand1 and operand2 and stores infimum of result in infimum of resultant"]
    pub fn SCIPintervalAddInf(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " adds operand1 and operand2 and stores supremum of result in supremum of resultant"]
    pub fn SCIPintervalAddSup(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " adds operand1 and operand2 and stores result in resultant"]
    pub fn SCIPintervalAdd(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " adds operand1 and scalar operand2 and stores result in resultant"]
    pub fn SCIPintervalAddScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
unsafe extern "C" {
    #[doc = " adds vector operand1 and vector operand2 and stores result in vector resultant"]
    pub fn SCIPintervalAddVectors(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        length: ::std::os::raw::c_int,
        operand1: *mut SCIP_INTERVAL,
        operand2: *mut SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " subtracts operand2 from operand1 and stores result in resultant"]
    pub fn SCIPintervalSub(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " subtracts scalar operand2 from operand1 and stores result in resultant"]
    pub fn SCIPintervalSubScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
unsafe extern "C" {
    #[doc = " multiplies operand1 with operand2 and stores infimum of result in infimum of resultant"]
    pub fn SCIPintervalMulInf(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " multiplies operand1 with operand2 and stores supremum of result in supremum of resultant"]
    pub fn SCIPintervalMulSup(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " multiplies operand1 with operand2 and stores result in resultant"]
    pub fn SCIPintervalMul(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " multiplies operand1 with scalar operand2 and stores infimum of result in infimum of resultant"]
    pub fn SCIPintervalMulScalarInf(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
unsafe extern "C" {
    #[doc = " multiplies operand1 with scalar operand2 and stores supremum of result in supremum of resultant"]
    pub fn SCIPintervalMulScalarSup(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
unsafe extern "C" {
    #[doc = " multiplies operand1 with scalar operand2 and stores result in resultant"]
    pub fn SCIPintervalMulScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
unsafe extern "C" {
    #[doc = " divides operand1 by operand2 and stores result in resultant"]
    pub fn SCIPintervalDiv(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " divides operand1 by scalar operand2 and stores result in resultant"]
    pub fn SCIPintervalDivScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
unsafe extern "C" {
    #[doc = " computes the scalar product of two vectors of intervals and stores result in resultant"]
    pub fn SCIPintervalScalprod(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        length: ::std::os::raw::c_int,
        operand1: *mut SCIP_INTERVAL,
        operand2: *mut SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " computes the scalar product of a vector of intervals and a vector of scalars and stores infimum of result in infimum of resultant"]
    pub fn SCIPintervalScalprodScalarsInf(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        length: ::std::os::raw::c_int,
        operand1: *mut SCIP_INTERVAL,
        operand2: *mut f64,
    );
}
unsafe extern "C" {
    #[doc = " computes the scalar product of a vector of intervals and a vector of scalars and stores supremum of result in supremum of resultant"]
    pub fn SCIPintervalScalprodScalarsSup(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        length: ::std::os::raw::c_int,
        operand1: *mut SCIP_INTERVAL,
        operand2: *mut f64,
    );
}
unsafe extern "C" {
    #[doc = " computes the scalar product of a vector of intervals and a vector of scalars and stores result in resultant"]
    pub fn SCIPintervalScalprodScalars(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        length: ::std::os::raw::c_int,
        operand1: *mut SCIP_INTERVAL,
        operand2: *mut f64,
    );
}
unsafe extern "C" {
    #[doc = " squares operand and stores result in resultant"]
    pub fn SCIPintervalSquare(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
unsafe extern "C" {
    #[doc = " stores (positive part of) square root of operand in resultant\n @attention we assume a correctly rounded sqrt(double) function when rounding is to nearest"]
    pub fn SCIPintervalSquareRoot(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " stores operand1 to the power of operand2 in resultant\n\n uses SCIPintervalPowerScalar if operand2 is a scalar, otherwise computes exp(op2*log(op1))"]
    pub fn SCIPintervalPower(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " stores operand1 to the power of the scalar operand2 in resultant\n @attention we assume a correctly rounded pow(double) function when rounding is to nearest"]
    pub fn SCIPintervalPowerScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
unsafe extern "C" {
    #[doc = " stores bounds on the power of a scalar operand1 to a scalar operand2 in resultant\n\n Both operands need to be finite numbers.\n Needs to have operand1 &ge; 0 or operand2 integer and needs to have operand2 &ge; 0 if operand1 = 0.\n @attention we assume a correctly rounded pow(double) function when rounding is to nearest"]
    pub fn SCIPintervalPowerScalarScalar(
        resultant: *mut SCIP_INTERVAL,
        operand1: f64,
        operand2: f64,
    );
}
unsafe extern "C" {
    #[doc = " computes lower bound on power of a scalar operand1 to an integer operand2\n\n Both operands need to be finite numbers.\n Needs to have operand1 &ge; 0 and need to have operand2 &ge; 0 if operand1 = 0."]
    pub fn SCIPintervalPowerScalarIntegerInf(operand1: f64, operand2: ::std::os::raw::c_int)
    -> f64;
}
unsafe extern "C" {
    #[doc = " computes upper bound on power of a scalar operand1 to an integer operand2\n\n Both operands need to be finite numbers.\n Needs to have operand1 &ge; 0 and needs to have operand2 &ge; 0 if operand1 = 0."]
    pub fn SCIPintervalPowerScalarIntegerSup(operand1: f64, operand2: ::std::os::raw::c_int)
    -> f64;
}
unsafe extern "C" {
    #[doc = " computes bounds on power of a scalar operand1 to an integer operand2\n\n Both operands need to be finite numbers.\n Needs to have operand1 &ge; 0 and needs to have operand2 &ge; 0 if operand1 = 0."]
    pub fn SCIPintervalPowerScalarInteger(
        resultant: *mut SCIP_INTERVAL,
        operand1: f64,
        operand2: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " given an interval for the image of a power operation, computes an interval for the origin\n\n That is, for \\f$y = x^p\\f$ with the exponent \\f$p\\f$ a given scalar and \\f$y\\f$ = `image` a given interval,\n computes \\f$x \\subseteq \\text{basedomain}\\f$ such that \\f$y \\in x^p\\f$ and such that for all \\f$z \\in \\text{basedomain} \\setminus x: z^p \\not \\in y\\f$."]
    pub fn SCIPintervalPowerScalarInverse(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        basedomain: SCIP_INTERVAL,
        exponent: f64,
        image: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " stores operand1 to the signed power of the scalar positive operand2 in resultant\n\n The signed power of x w.r.t. an exponent n &ge; 0 is given as \\f$\\mathrm{sign}(x) |x|^n\\f$.\n\n @attention we assume correctly rounded sqrt(double) and pow(double) functions when rounding is to nearest"]
    pub fn SCIPintervalSignPowerScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: f64,
    );
}
unsafe extern "C" {
    #[doc = " computes the reciprocal of an interval"]
    pub fn SCIPintervalReciprocal(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " stores exponential of operand in resultant\n @attention we assume a correctly rounded exp(double) function when rounding is to nearest"]
    pub fn SCIPintervalExp(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
unsafe extern "C" {
    #[doc = " stores natural logarithm of operand in resultant\n @attention we assume a correctly rounded log(double) function when rounding is to nearest"]
    pub fn SCIPintervalLog(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
unsafe extern "C" {
    #[doc = " stores minimum of operands in resultant"]
    pub fn SCIPintervalMin(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " stores maximum of operands in resultant"]
    pub fn SCIPintervalMax(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand1: SCIP_INTERVAL,
        operand2: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " returns the maximum of the absolute values of the infimum and supremum of the interval"]
    pub fn SCIPintervalAbsMax(interval: SCIP_INTERVAL) -> f64;
}
unsafe extern "C" {
    #[doc = " stores absolute value of operand in resultant"]
    pub fn SCIPintervalAbs(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
unsafe extern "C" {
    #[doc = " stores sine value of operand in resultant"]
    pub fn SCIPintervalSin(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
unsafe extern "C" {
    #[doc = " stores cosine value of operand in resultant"]
    pub fn SCIPintervalCos(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
unsafe extern "C" {
    #[doc = " stores sign of operand in resultant"]
    pub fn SCIPintervalSign(infinity: f64, resultant: *mut SCIP_INTERVAL, operand: SCIP_INTERVAL);
}
unsafe extern "C" {
    #[doc = " stores entropy of operand in resultant"]
    pub fn SCIPintervalEntropy(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        operand: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " computes exact upper bound on \\f$ a x^2 + b x \\f$ for x in [xlb, xub], b an interval, and a scalar\n\n Uses Algorithm 2.2 from Domes and Neumaier: Constraint propagation on quadratic constraints (2008)."]
    pub fn SCIPintervalQuadUpperBound(
        infinity: f64,
        a: f64,
        b_: SCIP_INTERVAL,
        x: SCIP_INTERVAL,
    ) -> f64;
}
unsafe extern "C" {
    #[doc = " stores range of quadratic term in resultant\n\n given scalar a and intervals b and x, computes interval for \\f$ a x^2 + b x \\f$"]
    pub fn SCIPintervalQuad(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        sqrcoeff: f64,
        lincoeff: SCIP_INTERVAL,
        xrng: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " computes interval with positive solutions of a quadratic equation with interval coefficients\n\n Given intervals a, b, and c, this function computes an interval that contains all positive solutions of \\f$ a x^2 + b x \\in c\\f$ within xbnds."]
    pub fn SCIPintervalSolveUnivariateQuadExpressionPositive(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        sqrcoeff: SCIP_INTERVAL,
        lincoeff: SCIP_INTERVAL,
        rhs: SCIP_INTERVAL,
        xbnds: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " computes interval with negative solutions of a quadratic equation with interval coefficients\n\n Given intervals a, b, and c, this function computes an interval that contains all negative solutions of \\f$ a x^2 + b x \\in c\\f$ within xbnds."]
    pub fn SCIPintervalSolveUnivariateQuadExpressionNegative(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        sqrcoeff: SCIP_INTERVAL,
        lincoeff: SCIP_INTERVAL,
        rhs: SCIP_INTERVAL,
        xbnds: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " computes positive solutions of a quadratic equation with scalar coefficients\n\n Givens scalar a, b, and c, this function computes an interval that contains all positive solutions of \\f$ a x^2 + b x \\geq c\\f$ within xbnds.\n Implements Algorithm 3.2 from Domes and Neumaier: Constraint propagation on quadratic constraints (2008)."]
    pub fn SCIPintervalSolveUnivariateQuadExpressionPositiveAllScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        sqrcoeff: f64,
        lincoeff: f64,
        rhs: f64,
        xbnds: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " solves a quadratic equation with interval coefficients\n\n Given intervals a, b and c, this function computes an interval that contains all solutions of \\f$ a x^2 + b x \\in c\\f$ within xbnds."]
    pub fn SCIPintervalSolveUnivariateQuadExpression(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        sqrcoeff: SCIP_INTERVAL,
        lincoeff: SCIP_INTERVAL,
        rhs: SCIP_INTERVAL,
        xbnds: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " stores range of bivariate quadratic term in resultant\n\n Given scalars \\f$a_x\\f$, \\f$a_y\\f$, \\f$a_{xy}\\f$, \\f$b_x\\f$, and \\f$b_y\\f$ and intervals for \\f$x\\f$ and \\f$y\\f$,\n computes interval for \\f$ a_x x^2 + a_y y^2 + a_{xy} x y + b_x x + b_y y \\f$.\n\n \\attention The operations are not applied rounding-safe here!"]
    pub fn SCIPintervalQuadBivar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        ax: f64,
        ay: f64,
        axy: f64,
        bx: f64,
        by: f64,
        xbnds: SCIP_INTERVAL,
        ybnds: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " solves a bivariate quadratic equation for the first variable\n\n Given scalars \\f$a_x\\f$, \\f$a_y\\f$, \\f$a_{xy}\\f$, \\f$b_x\\f$ and \\f$b_y\\f$, and intervals for \\f$x\\f$, \\f$y\\f$, and rhs,\n computes \\f$ \\{ x \\in \\mathbf{x} : \\exists y \\in \\mathbf{y} : a_x x^2 + a_y y^2 + a_{xy} x y + b_x x + b_y y \\in \\mathbf{\\mbox{rhs}} \\} \\f$.\n\n \\attention the operations are not applied rounding-safe here"]
    pub fn SCIPintervalSolveBivariateQuadExpressionAllScalar(
        infinity: f64,
        resultant: *mut SCIP_INTERVAL,
        ax: f64,
        ay: f64,
        axy: f64,
        bx: f64,
        by: f64,
        rhs: SCIP_INTERVAL,
        xbnds: SCIP_INTERVAL,
        ybnds: SCIP_INTERVAL,
    );
}
unsafe extern "C" {
    #[doc = " propagates a weighted sum of intervals in a given interval\n\n Given \\f$\\text{constant} + \\sum_i \\text{weights}_i \\text{operands}_i \\in \\text{rhs}\\f$,\n computes possibly tighter interval for each term.\n\n @attention Valid values are returned in resultants only if any tightening has been found and no empty interval, that is, function returns with non-zero and `*infeasible` = FALSE.\n\n @return Number of terms for which resulting interval is smaller than operand interval."]
    pub fn SCIPintervalPropagateWeightedSum(
        infinity: f64,
        noperands: ::std::os::raw::c_int,
        operands: *mut SCIP_INTERVAL,
        weights: *mut f64,
        constant: f64,
        rhs: SCIP_INTERVAL,
        resultants: *mut SCIP_INTERVAL,
        infeasible: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ExprData {
    _unused: [u8; 0],
}
pub type SCIP_EXPRDATA = SCIP_ExprData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Expr {
    _unused: [u8; 0],
}
pub type SCIP_EXPR = SCIP_Expr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SYM_ExprData {
    _unused: [u8; 0],
}
pub type SYM_EXPRDATA = SYM_ExprData;
#[doc = "< unknown or indefinite curvature"]
pub const SCIP_EXPRCURV_SCIP_EXPRCURV_UNKNOWN: SCIP_EXPRCURV = 0;
#[doc = "< convex"]
pub const SCIP_EXPRCURV_SCIP_EXPRCURV_CONVEX: SCIP_EXPRCURV = 1;
#[doc = "< concave"]
pub const SCIP_EXPRCURV_SCIP_EXPRCURV_CONCAVE: SCIP_EXPRCURV = 2;
#[doc = "< linear = convex and concave"]
pub const SCIP_EXPRCURV_SCIP_EXPRCURV_LINEAR: SCIP_EXPRCURV = 3;
#[doc = " curvature types"]
pub type SCIP_EXPRCURV = ::std::os::raw::c_uint;
#[doc = "< unknown or non-monotone"]
pub const SCIP_MONOTONE_SCIP_MONOTONE_UNKNOWN: SCIP_MONOTONE = 0;
#[doc = "< increasing"]
pub const SCIP_MONOTONE_SCIP_MONOTONE_INC: SCIP_MONOTONE = 1;
#[doc = "< decreasing"]
pub const SCIP_MONOTONE_SCIP_MONOTONE_DEC: SCIP_MONOTONE = 2;
#[doc = "< constant = increasing and decreasing"]
pub const SCIP_MONOTONE_SCIP_MONOTONE_CONST: SCIP_MONOTONE = 3;
#[doc = " monotonicity"]
pub type SCIP_MONOTONE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Expr_OwnerData {
    _unused: [u8; 0],
}
#[doc = "@name Expression Owner */\n/**@{"]
pub type SCIP_EXPR_OWNERDATA = SCIP_Expr_OwnerData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Exprhdlr {
    _unused: [u8; 0],
}
#[doc = "@name Expression Handler */\n/**@{"]
pub type SCIP_EXPRHDLR = SCIP_Exprhdlr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ExprhdlrData {
    _unused: [u8; 0],
}
pub type SCIP_EXPRHDLRDATA = SCIP_ExprhdlrData;
#[doc = " stage of DFS iterator"]
pub type SCIP_EXPRITER_STAGE = ::std::os::raw::c_uint;
#[doc = " user data storage type for expression iteration"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union SCIP_EXPRITER_USERDATA {
    #[doc = "< a floating-point value"]
    pub realval: f64,
    #[doc = "< an integer value"]
    pub intval: ::std::os::raw::c_int,
    #[doc = "< two integer values"]
    pub intvals: [::std::os::raw::c_int; 2usize],
    #[doc = "< an unsigned integer value"]
    pub uintval: ::std::os::raw::c_uint,
    #[doc = "< a pointer"]
    pub ptrval: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCIP_EXPRITER_USERDATA"][::std::mem::size_of::<SCIP_EXPRITER_USERDATA>() - 8usize];
    ["Alignment of SCIP_EXPRITER_USERDATA"]
        [::std::mem::align_of::<SCIP_EXPRITER_USERDATA>() - 8usize];
    ["Offset of field: SCIP_EXPRITER_USERDATA::realval"]
        [::std::mem::offset_of!(SCIP_EXPRITER_USERDATA, realval) - 0usize];
    ["Offset of field: SCIP_EXPRITER_USERDATA::intval"]
        [::std::mem::offset_of!(SCIP_EXPRITER_USERDATA, intval) - 0usize];
    ["Offset of field: SCIP_EXPRITER_USERDATA::intvals"]
        [::std::mem::offset_of!(SCIP_EXPRITER_USERDATA, intvals) - 0usize];
    ["Offset of field: SCIP_EXPRITER_USERDATA::uintval"]
        [::std::mem::offset_of!(SCIP_EXPRITER_USERDATA, uintval) - 0usize];
    ["Offset of field: SCIP_EXPRITER_USERDATA::ptrval"]
        [::std::mem::offset_of!(SCIP_EXPRITER_USERDATA, ptrval) - 0usize];
};
#[doc = "< reverse topological order"]
pub const SCIP_EXPRITER_TYPE_SCIP_EXPRITER_RTOPOLOGIC: SCIP_EXPRITER_TYPE = 0;
#[doc = "< breadth-first search"]
pub const SCIP_EXPRITER_TYPE_SCIP_EXPRITER_BFS: SCIP_EXPRITER_TYPE = 1;
#[doc = "< depth-first search"]
pub const SCIP_EXPRITER_TYPE_SCIP_EXPRITER_DFS: SCIP_EXPRITER_TYPE = 2;
#[doc = " mode for expression iterator"]
pub type SCIP_EXPRITER_TYPE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ExprIterData {
    _unused: [u8; 0],
}
pub type SCIP_EXPRITERDATA = SCIP_ExprIterData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ExprIter {
    _unused: [u8; 0],
}
pub type SCIP_EXPRITER = SCIP_ExprIter;
pub type SCIP_EXPRPRINT_WHAT = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ExprPrintData {
    _unused: [u8; 0],
}
pub type SCIP_EXPRPRINTDATA = SCIP_ExprPrintData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Compr {
    _unused: [u8; 0],
}
pub type SCIP_COMPR = SCIP_Compr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ComprData {
    _unused: [u8; 0],
}
pub type SCIP_COMPRDATA = SCIP_ComprData;
#[doc = "< downwards branching: decreasing upper bound"]
pub const SCIP_BranchDir_SCIP_BRANCHDIR_DOWNWARDS: SCIP_BranchDir = 0;
#[doc = "< upwards branching: increasing lower bound"]
pub const SCIP_BranchDir_SCIP_BRANCHDIR_UPWARDS: SCIP_BranchDir = 1;
#[doc = "< fixed branching: both bounds changed"]
pub const SCIP_BranchDir_SCIP_BRANCHDIR_FIXED: SCIP_BranchDir = 2;
#[doc = "< automatic setting for choosing bound changes"]
pub const SCIP_BranchDir_SCIP_BRANCHDIR_AUTO: SCIP_BranchDir = 3;
#[doc = " branching direction for branching on variables"]
pub type SCIP_BranchDir = ::std::os::raw::c_uint;
#[doc = " branching direction for branching on variables"]
pub use self::SCIP_BranchDir as SCIP_BRANCHDIR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_History {
    _unused: [u8; 0],
}
pub type SCIP_HISTORY = SCIP_History;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ValueHistory {
    _unused: [u8; 0],
}
#[doc = " Value history data structure\n\n  branching and inference history informations for single variable dependent on the domain value\n\n  - \\ref SCIP_VALUEHISTORY \"List of all available methods\""]
pub type SCIP_VALUEHISTORY = SCIP_ValueHistory;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_IISfinder {
    _unused: [u8; 0],
}
pub type SCIP_IISFINDER = SCIP_IISfinder;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_IISfinderData {
    _unused: [u8; 0],
}
pub type SCIP_IISFINDERDATA = SCIP_IISfinderData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_IIS {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NodePQ {
    _unused: [u8; 0],
}
pub type SCIP_NODEPQ = SCIP_NodePQ;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Nodesel {
    _unused: [u8; 0],
}
pub type SCIP_NODESEL = SCIP_Nodesel;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NodeselData {
    _unused: [u8; 0],
}
pub type SCIP_NODESELDATA = SCIP_NodeselData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Presol {
    _unused: [u8; 0],
}
pub type SCIP_PRESOL = SCIP_Presol;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PresolData {
    _unused: [u8; 0],
}
pub type SCIP_PRESOLDATA = SCIP_PresolData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Pricer {
    _unused: [u8; 0],
}
pub type SCIP_PRICER = SCIP_Pricer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PricerData {
    _unused: [u8; 0],
}
pub type SCIP_PRICERDATA = SCIP_PricerData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Reader {
    _unused: [u8; 0],
}
pub type SCIP_READER = SCIP_Reader;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ReaderData {
    _unused: [u8; 0],
}
pub type SCIP_READERDATA = SCIP_ReaderData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Relax {
    _unused: [u8; 0],
}
pub type SCIP_RELAX = SCIP_Relax;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Relaxation {
    _unused: [u8; 0],
}
pub type SCIP_RELAXATION = SCIP_Relaxation;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_RelaxData {
    _unused: [u8; 0],
}
pub type SCIP_RELAXDATA = SCIP_RelaxData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Reopt {
    _unused: [u8; 0],
}
pub type SCIP_REOPT = SCIP_Reopt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SolTree {
    _unused: [u8; 0],
}
pub type SCIP_SOLTREE = SCIP_SolTree;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SolNode {
    _unused: [u8; 0],
}
pub type SCIP_SOLNODE = SCIP_SolNode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ReoptTree {
    _unused: [u8; 0],
}
pub type SCIP_REOPTTREE = SCIP_ReoptTree;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ReoptNode {
    _unused: [u8; 0],
}
pub type SCIP_REOPTNODE = SCIP_ReoptNode;
pub type SCIP_REPRESENTATIVE = SCIP_ReoptNode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ReoptConsData {
    _unused: [u8; 0],
}
pub type SCIP_REOPTCONSDATA = SCIP_ReoptConsData;
#[doc = "< node is not part of the reoptimizationtree"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_NONE: SCIP_ReoptType = 0;
#[doc = "< node is only needed for reconstructing the tree"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_TRANSIT: SCIP_ReoptType = 1;
#[doc = "< node contains dual reductions which leed to LP infeasibility"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_INFSUBTREE: SCIP_ReoptType = 2;
#[doc = "< node contains dual reductions"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_STRBRANCHED: SCIP_ReoptType = 3;
#[doc = "< node contains additional constraints"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_LOGICORNODE: SCIP_ReoptType = 4;
#[doc = "< node is a leaf node"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_LEAF: SCIP_ReoptType = 5;
#[doc = "< node is a leaf node and pruned by boudning"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_PRUNED: SCIP_ReoptType = 6;
#[doc = "< node is a leaf node and has an integral optimal LP solution"]
pub const SCIP_ReoptType_SCIP_REOPTTYPE_FEASIBLE: SCIP_ReoptType = 7;
pub type SCIP_ReoptType = ::std::os::raw::c_uint;
pub use self::SCIP_ReoptType as SCIP_REOPTTYPE;
#[doc = "< constraint cutoffs an LP infeasible subtree"]
pub const Reopt_ConsType_REOPT_CONSTYPE_INFSUBTREE: Reopt_ConsType = 0;
#[doc = "< constraint reconstructs dual reductions"]
pub const Reopt_ConsType_REOPT_CONSTYPE_DUALREDS: Reopt_ConsType = 1;
#[doc = "< constraint representing a cut, e.g., to separate a solution"]
pub const Reopt_ConsType_REOPT_CONSTYPE_CUT: Reopt_ConsType = 2;
#[doc = "< constraint was added by SCIP, e.g., a (local) conflict"]
pub const Reopt_ConsType_REOPT_CONSTYPE_UNKNOWN: Reopt_ConsType = 3;
pub type Reopt_ConsType = ::std::os::raw::c_uint;
pub use self::Reopt_ConsType as REOPT_CONSTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Sepa {
    _unused: [u8; 0],
}
pub type SCIP_SEPA = SCIP_Sepa;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SepaData {
    _unused: [u8; 0],
}
pub type SCIP_SEPADATA = SCIP_SepaData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Cutsel {
    _unused: [u8; 0],
}
pub type SCIP_CUTSEL = SCIP_Cutsel;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_CutselData {
    _unused: [u8; 0],
}
pub type SCIP_CUTSELDATA = SCIP_CutselData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Table {
    _unused: [u8; 0],
}
pub type SCIP_TABLE = SCIP_Table;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_TableData {
    _unused: [u8; 0],
}
pub type SCIP_TABLEDATA = SCIP_TableData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Prop {
    _unused: [u8; 0],
}
pub type SCIP_PROP = SCIP_Prop;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_PropData {
    _unused: [u8; 0],
}
pub type SCIP_PROPDATA = SCIP_PropData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Nlpi {
    _unused: [u8; 0],
}
pub type SCIP_NLPI = SCIP_Nlpi;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NlpiData {
    _unused: [u8; 0],
}
pub type SCIP_NLPIDATA = SCIP_NlpiData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NlpiProblem {
    _unused: [u8; 0],
}
pub type SCIP_NLPIPROBLEM = SCIP_NlpiProblem;
#[doc = "< never stop if progress is still possible"]
pub const SCIP_NlpParam_FastFail_SCIP_NLPPARAM_FASTFAIL_OFF: SCIP_NlpParam_FastFail = 0;
#[doc = "< stop if it seems unlikely that an improving point can be found"]
pub const SCIP_NlpParam_FastFail_SCIP_NLPPARAM_FASTFAIL_CONSERVATIVE: SCIP_NlpParam_FastFail = 1;
#[doc = "< stop if convergence rate is low"]
pub const SCIP_NlpParam_FastFail_SCIP_NLPPARAM_FASTFAIL_AGGRESSIVE: SCIP_NlpParam_FastFail = 2;
#[doc = " NLP solver fast-fail levels"]
pub type SCIP_NlpParam_FastFail = ::std::os::raw::c_uint;
#[doc = " NLP solver fast-fail levels"]
pub use self::SCIP_NlpParam_FastFail as SCIP_NLPPARAM_FASTFAIL;
#[doc = " parameters for NLP solve"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NlpParam {
    #[doc = "< lower objective limit (cutoff)"]
    pub lobjlimit: f64,
    #[doc = "< feasibility tolerance (maximal allowed absolute violation of constraints and variable bounds)"]
    pub feastol: f64,
    #[doc = "< optimality tolerance (maximal allowed absolute violation of optimality conditions)"]
    pub opttol: f64,
    #[doc = "< solver-specific tolerance on accuracy, e.g., maximal violation of feasibility and optimality in scaled problem (0.0: use solver default)"]
    pub solvertol: f64,
    #[doc = "< time limit in seconds: use SCIP_REAL_MAX to use remaining time available for SCIP solve (limits/time - currenttime)"]
    pub timelimit: f64,
    #[doc = "< iteration limit"]
    pub iterlimit: ::std::os::raw::c_int,
    #[doc = "< verbosity level of output of NLP solver to the screen: 0 off, 1 normal, 2 debug, > 2 more debug"]
    pub verblevel: ::std::os::raw::c_ushort,
    #[doc = "< whether the NLP solver should stop early if convergence is slow"]
    pub fastfail: SCIP_NLPPARAM_FASTFAIL,
    #[doc = "< whether to expect an infeasible problem"]
    pub expectinfeas: ::std::os::raw::c_uint,
    #[doc = "< whether to try to use solution of previous solve as starting point (if available)"]
    pub warmstart: ::std::os::raw::c_uint,
    #[doc = "< name of file from which NLP is solved (it's fine to set this to NULL)"]
    pub caller: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCIP_NlpParam"][::std::mem::size_of::<SCIP_NlpParam>() - 72usize];
    ["Alignment of SCIP_NlpParam"][::std::mem::align_of::<SCIP_NlpParam>() - 8usize];
    ["Offset of field: SCIP_NlpParam::lobjlimit"]
        [::std::mem::offset_of!(SCIP_NlpParam, lobjlimit) - 0usize];
    ["Offset of field: SCIP_NlpParam::feastol"]
        [::std::mem::offset_of!(SCIP_NlpParam, feastol) - 8usize];
    ["Offset of field: SCIP_NlpParam::opttol"]
        [::std::mem::offset_of!(SCIP_NlpParam, opttol) - 16usize];
    ["Offset of field: SCIP_NlpParam::solvertol"]
        [::std::mem::offset_of!(SCIP_NlpParam, solvertol) - 24usize];
    ["Offset of field: SCIP_NlpParam::timelimit"]
        [::std::mem::offset_of!(SCIP_NlpParam, timelimit) - 32usize];
    ["Offset of field: SCIP_NlpParam::iterlimit"]
        [::std::mem::offset_of!(SCIP_NlpParam, iterlimit) - 40usize];
    ["Offset of field: SCIP_NlpParam::verblevel"]
        [::std::mem::offset_of!(SCIP_NlpParam, verblevel) - 44usize];
    ["Offset of field: SCIP_NlpParam::fastfail"]
        [::std::mem::offset_of!(SCIP_NlpParam, fastfail) - 48usize];
    ["Offset of field: SCIP_NlpParam::expectinfeas"]
        [::std::mem::offset_of!(SCIP_NlpParam, expectinfeas) - 52usize];
    ["Offset of field: SCIP_NlpParam::warmstart"]
        [::std::mem::offset_of!(SCIP_NlpParam, warmstart) - 56usize];
    ["Offset of field: SCIP_NlpParam::caller"]
        [::std::mem::offset_of!(SCIP_NlpParam, caller) - 64usize];
};
#[doc = " parameters for NLP solve"]
pub type SCIP_NLPPARAM = SCIP_NlpParam;
#[doc = "< solved to global optimality"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_GLOBOPT: SCIP_NlpSolStat = 0;
#[doc = "< solved to local optimality"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_LOCOPT: SCIP_NlpSolStat = 1;
#[doc = "< feasible solution found"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_FEASIBLE: SCIP_NlpSolStat = 2;
#[doc = "< solution found is local infeasible"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_LOCINFEASIBLE: SCIP_NlpSolStat = 3;
#[doc = "< problem is proven infeasible"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_GLOBINFEASIBLE: SCIP_NlpSolStat = 4;
#[doc = "< problem is unbounded"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_UNBOUNDED: SCIP_NlpSolStat = 5;
#[doc = "< unknown solution status (e.g., problem not solved yet)"]
pub const SCIP_NlpSolStat_SCIP_NLPSOLSTAT_UNKNOWN: SCIP_NlpSolStat = 6;
#[doc = " NLP solution status"]
pub type SCIP_NlpSolStat = ::std::os::raw::c_uint;
#[doc = " NLP solution status"]
pub use self::SCIP_NlpSolStat as SCIP_NLPSOLSTAT;
#[doc = "< terminated successfully"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_OKAY: SCIP_NlpTermStat = 0;
#[doc = "< time limit exceeded"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_TIMELIMIT: SCIP_NlpTermStat = 1;
#[doc = "< iteration limit exceeded"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_ITERLIMIT: SCIP_NlpTermStat = 2;
#[doc = "< lower objective limit reached"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_LOBJLIMIT: SCIP_NlpTermStat = 3;
#[doc = "< SCIP has been asked to stop (SCIPinterruptSolve() called)"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_INTERRUPT: SCIP_NlpTermStat = 4;
#[doc = "< stopped on numerical error"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_NUMERICERROR: SCIP_NlpTermStat = 5;
#[doc = "< stopped on function evaluation error"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_EVALERROR: SCIP_NlpTermStat = 6;
#[doc = "< memory exceeded"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_OUTOFMEMORY: SCIP_NlpTermStat = 7;
#[doc = "< problems with license of NLP solver"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_LICENSEERROR: SCIP_NlpTermStat = 8;
#[doc = "< other error (= this should never happen)"]
pub const SCIP_NlpTermStat_SCIP_NLPTERMSTAT_OTHER: SCIP_NlpTermStat = 9;
#[doc = " NLP solver termination status"]
pub type SCIP_NlpTermStat = ::std::os::raw::c_uint;
#[doc = " NLP solver termination status"]
pub use self::SCIP_NlpTermStat as SCIP_NLPTERMSTAT;
#[doc = " Statistics from an NLP solve"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_NlpStatistics {
    #[doc = "< number of iterations the NLP solver spend in the last solve command"]
    pub niterations: ::std::os::raw::c_int,
    #[doc = "< total time in CPU sections the NLP solver spend in the last solve command"]
    pub totaltime: f64,
    #[doc = "< time spend in evaluation of functions and their derivatives (only measured if timing/nlpieval = TRUE)"]
    pub evaltime: f64,
    #[doc = "< maximal absolute constraint violation in current solution, or SCIP_INVALID if not available"]
    pub consviol: f64,
    #[doc = "< maximal absolute variable bound violation in current solution, or SCIP_INVALID if not available"]
    pub boundviol: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SCIP_NlpStatistics"][::std::mem::size_of::<SCIP_NlpStatistics>() - 40usize];
    ["Alignment of SCIP_NlpStatistics"][::std::mem::align_of::<SCIP_NlpStatistics>() - 8usize];
    ["Offset of field: SCIP_NlpStatistics::niterations"]
        [::std::mem::offset_of!(SCIP_NlpStatistics, niterations) - 0usize];
    ["Offset of field: SCIP_NlpStatistics::totaltime"]
        [::std::mem::offset_of!(SCIP_NlpStatistics, totaltime) - 8usize];
    ["Offset of field: SCIP_NlpStatistics::evaltime"]
        [::std::mem::offset_of!(SCIP_NlpStatistics, evaltime) - 16usize];
    ["Offset of field: SCIP_NlpStatistics::consviol"]
        [::std::mem::offset_of!(SCIP_NlpStatistics, consviol) - 24usize];
    ["Offset of field: SCIP_NlpStatistics::boundviol"]
        [::std::mem::offset_of!(SCIP_NlpStatistics, boundviol) - 32usize];
};
#[doc = " Statistics from an NLP solve"]
pub type SCIP_NLPSTATISTICS = SCIP_NlpStatistics;
#[doc = "< the solving status is not yet known"]
pub const SCIP_Status_SCIP_STATUS_UNKNOWN: SCIP_Status = 0;
#[doc = "< the problem was solved to optimality, an optimal solution is available"]
pub const SCIP_Status_SCIP_STATUS_OPTIMAL: SCIP_Status = 1;
#[doc = "< the problem was proven to be infeasible"]
pub const SCIP_Status_SCIP_STATUS_INFEASIBLE: SCIP_Status = 2;
#[doc = "< the problem was proven to be unbounded"]
pub const SCIP_Status_SCIP_STATUS_UNBOUNDED: SCIP_Status = 3;
#[doc = "< the problem was proven to be either infeasible or unbounded"]
pub const SCIP_Status_SCIP_STATUS_INFORUNBD: SCIP_Status = 4;
#[doc = "< the user interrupted the solving process (SIGINT or SCIPinterruptSolve())"]
pub const SCIP_Status_SCIP_STATUS_USERINTERRUPT: SCIP_Status = 10;
#[doc = "< the process received a SIGTERM signal"]
pub const SCIP_Status_SCIP_STATUS_TERMINATE: SCIP_Status = 11;
#[doc = "< the solving process was interrupted because the node limit was reached"]
pub const SCIP_Status_SCIP_STATUS_NODELIMIT: SCIP_Status = 20;
#[doc = "< the solving process was interrupted because the total node limit was\n   reached (incl. restarts)"]
pub const SCIP_Status_SCIP_STATUS_TOTALNODELIMIT: SCIP_Status = 21;
#[doc = "< the solving process was interrupted because the stalling node limit was\n   reached (no improvement w.r.t. primal bound)"]
pub const SCIP_Status_SCIP_STATUS_STALLNODELIMIT: SCIP_Status = 22;
#[doc = "< the solving process was interrupted because the time limit was reached"]
pub const SCIP_Status_SCIP_STATUS_TIMELIMIT: SCIP_Status = 23;
#[doc = "< the solving process was interrupted because the memory limit was reached"]
pub const SCIP_Status_SCIP_STATUS_MEMLIMIT: SCIP_Status = 24;
#[doc = "< the solving process was interrupted because the gap limit was reached"]
pub const SCIP_Status_SCIP_STATUS_GAPLIMIT: SCIP_Status = 25;
#[doc = "< the solving process was interrupted because the primal limit was reached"]
pub const SCIP_Status_SCIP_STATUS_PRIMALLIMIT: SCIP_Status = 26;
#[doc = "< the solving process was interrupted because the dual limit was reached"]
pub const SCIP_Status_SCIP_STATUS_DUALLIMIT: SCIP_Status = 27;
#[doc = "< the solving process was interrupted because the solution limit was reached"]
pub const SCIP_Status_SCIP_STATUS_SOLLIMIT: SCIP_Status = 28;
#[doc = "< the solving process was interrupted because the solution improvement limit\n   was reached"]
pub const SCIP_Status_SCIP_STATUS_BESTSOLLIMIT: SCIP_Status = 29;
#[doc = "< the solving process was interrupted because the restart limit was reached"]
pub const SCIP_Status_SCIP_STATUS_RESTARTLIMIT: SCIP_Status = 30;
#[doc = " SCIP solving status"]
pub type SCIP_Status = ::std::os::raw::c_uint;
#[doc = " SCIP solving status"]
pub use self::SCIP_Status as SCIP_STATUS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Stat {
    _unused: [u8; 0],
}
pub type SCIP_STAT = SCIP_Stat;
pub const SCIP_Parallelmode_SCIP_PARA_OPPORTUNISTIC: SCIP_Parallelmode = 0;
pub const SCIP_Parallelmode_SCIP_PARA_DETERMINISTIC: SCIP_Parallelmode = 1;
#[doc = " The parallel mode"]
pub type SCIP_Parallelmode = ::std::os::raw::c_uint;
#[doc = " The parallel mode"]
pub use self::SCIP_Parallelmode as SCIP_PARALLELMODE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SyncStore {
    _unused: [u8; 0],
}
pub type SCIP_SYNCSTORE = SCIP_SyncStore;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SyncData {
    _unused: [u8; 0],
}
pub type SCIP_SYNCDATA = SCIP_SyncData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BoundStore {
    _unused: [u8; 0],
}
pub type SCIP_BOUNDSTORE = SCIP_BoundStore;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConcSolverType {
    _unused: [u8; 0],
}
pub type SCIP_CONCSOLVERTYPE = SCIP_ConcSolverType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConcSolverTypeData {
    _unused: [u8; 0],
}
pub type SCIP_CONCSOLVERTYPEDATA = SCIP_ConcSolverTypeData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConcSolver {
    _unused: [u8; 0],
}
pub type SCIP_CONCSOLVER = SCIP_ConcSolver;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_ConcSolverData {
    _unused: [u8; 0],
}
pub type SCIP_CONCSOLVERDATA = SCIP_ConcSolverData;
#[doc = "< the Benders' subproblems are solved during the enforcement of an LP solution"]
pub const SCIP_BendersEnfoType_SCIP_BENDERSENFOTYPE_LP: SCIP_BendersEnfoType = 1;
#[doc = "< the Benders' subproblems are solved during the enforcement of a relaxation solution"]
pub const SCIP_BendersEnfoType_SCIP_BENDERSENFOTYPE_RELAX: SCIP_BendersEnfoType = 2;
#[doc = "< the Benders' subproblems are solved during the enforcement of a pseudo solution"]
pub const SCIP_BendersEnfoType_SCIP_BENDERSENFOTYPE_PSEUDO: SCIP_BendersEnfoType = 3;
#[doc = "< the Benders' subproblems are solved during the checking of a solution for feasibility"]
pub const SCIP_BendersEnfoType_SCIP_BENDERSENFOTYPE_CHECK: SCIP_BendersEnfoType = 4;
pub type SCIP_BendersEnfoType = ::std::os::raw::c_uint;
pub use self::SCIP_BendersEnfoType as SCIP_BENDERSENFOTYPE;
#[doc = "< the relaxation is solved in this iteration of the loop"]
pub const SCIP_BendersSolveLoop_SCIP_BENDERSSOLVELOOP_CONVEX: SCIP_BendersSolveLoop = 0;
#[doc = "< the CIP is solved in this iteration of the loop"]
pub const SCIP_BendersSolveLoop_SCIP_BENDERSSOLVELOOP_CIP: SCIP_BendersSolveLoop = 1;
#[doc = "< the user defined solve function is called"]
pub const SCIP_BendersSolveLoop_SCIP_BENDERSSOLVELOOP_USERCONVEX: SCIP_BendersSolveLoop = 2;
#[doc = "< the user defined solve function is called"]
pub const SCIP_BendersSolveLoop_SCIP_BENDERSSOLVELOOP_USERCIP: SCIP_BendersSolveLoop = 3;
pub type SCIP_BendersSolveLoop = ::std::os::raw::c_uint;
pub use self::SCIP_BendersSolveLoop as SCIP_BENDERSSOLVELOOP;
#[doc = "< the subsystem status is unknown"]
pub const SCIP_BendersSubStatus_SCIP_BENDERSSUBSTATUS_UNKNOWN: SCIP_BendersSubStatus = 0;
#[doc = "< the subsystem is solved to be optimal"]
pub const SCIP_BendersSubStatus_SCIP_BENDERSSUBSTATUS_OPTIMAL: SCIP_BendersSubStatus = 1;
#[doc = "< the subproblem is optimal, but the auxiliary variable is violated"]
pub const SCIP_BendersSubStatus_SCIP_BENDERSSUBSTATUS_AUXVIOL: SCIP_BendersSubStatus = 2;
#[doc = "< the subproblem is solved to be infeasible"]
pub const SCIP_BendersSubStatus_SCIP_BENDERSSUBSTATUS_INFEAS: SCIP_BendersSubStatus = 3;
pub type SCIP_BendersSubStatus = ::std::os::raw::c_uint;
pub use self::SCIP_BendersSubStatus as SCIP_BENDERSSUBSTATUS;
#[doc = "< the subproblem has convex constraints and continuous variables"]
pub const SCIP_BendersSubType_SCIP_BENDERSSUBTYPE_CONVEXCONT: SCIP_BendersSubType = 0;
#[doc = "< the subproblem has convex constraints and discrete variables"]
pub const SCIP_BendersSubType_SCIP_BENDERSSUBTYPE_CONVEXDIS: SCIP_BendersSubType = 1;
#[doc = "< the subproblem has non-convex constraints and continuous variables"]
pub const SCIP_BendersSubType_SCIP_BENDERSSUBTYPE_NONCONVEXCONT: SCIP_BendersSubType = 2;
#[doc = "< the subproblem has non-convex constraints and discrete variables"]
pub const SCIP_BendersSubType_SCIP_BENDERSSUBTYPE_NONCONVEXDIS: SCIP_BendersSubType = 3;
#[doc = "< the default type before the type is known"]
pub const SCIP_BendersSubType_SCIP_BENDERSSUBTYPE_UNKNOWN: SCIP_BendersSubType = 4;
pub type SCIP_BendersSubType = ::std::os::raw::c_uint;
pub use self::SCIP_BendersSubType as SCIP_BENDERSSUBTYPE;
#[doc = "< the individual subproblem objectives are summed in the master problem"]
pub const SCIP_BendersObjectiveType_SCIP_BENDERSOBJTYPE_SUM: SCIP_BendersObjectiveType = 0;
#[doc = "< the minimum of the maximum subproblem objectives is computed in the master problem"]
pub const SCIP_BendersObjectiveType_SCIP_BENDERSOBJTYPE_MAX: SCIP_BendersObjectiveType = 1;
pub type SCIP_BendersObjectiveType = ::std::os::raw::c_uint;
pub use self::SCIP_BendersObjectiveType as SCIP_BENDERSOBJTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Benders {
    _unused: [u8; 0],
}
pub type SCIP_BENDERS = SCIP_Benders;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BendersData {
    _unused: [u8; 0],
}
pub type SCIP_BENDERSDATA = SCIP_BendersData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_SubproblemSolveStat {
    _unused: [u8; 0],
}
pub type SCIP_SUBPROBLEMSOLVESTAT = SCIP_SubproblemSolveStat;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_Benderscut {
    _unused: [u8; 0],
}
pub type SCIP_BENDERSCUT = SCIP_Benderscut;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SCIP_BenderscutData {
    _unused: [u8; 0],
}
pub type SCIP_BENDERSCUTDATA = SCIP_BenderscutData;
unsafe extern "C" {
    #[doc = " create and resets an epsilon greedy bandit algorithm"]
    pub fn SCIPcreateBanditEpsgreedy(
        scip: *mut SCIP,
        epsgreedy: *mut *mut SCIP_BANDIT,
        priorities: *mut f64,
        eps: f64,
        usemodification: ::std::os::raw::c_uint,
        preferrecent: ::std::os::raw::c_uint,
        decayfactor: f64,
        avglim: ::std::os::raw::c_int,
        nactions: ::std::os::raw::c_int,
        initseed: ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
unsafe extern "C" {
    #[doc = " get weights array of epsilon greedy bandit algorithm"]
    pub fn SCIPgetWeightsEpsgreedy(epsgreedy: *mut SCIP_BANDIT) -> *mut f64;
}
unsafe extern "C" {
    #[doc = " set epsilon parameter of epsilon greedy bandit algorithm"]
    pub fn SCIPsetEpsilonEpsgreedy(epsgreedy: *mut SCIP_BANDIT, eps: f64);
}
unsafe extern "C" {
    #[doc = " creates and resets an Exp.3 bandit algorithm using \\p scip pointer"]
    pub fn SCIPcreateBanditExp3(
        scip: *mut SCIP,
        exp3: *mut *mut SCIP_BANDIT,
        priorities: *mut f64,
        gammaparam: f64,
        beta: f64,
        nactions: ::std::os::raw::c_int,
        initseed: ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
unsafe extern "C" {
    #[doc = " set gamma parameter of Exp.3 bandit algorithm to increase weight of uniform distribution"]
    pub fn SCIPsetGammaExp3(exp3: *mut SCIP_BANDIT, gammaparam: f64);
}
unsafe extern "C" {
    #[doc = " set beta parameter of Exp.3 bandit algorithm to increase gain offset for actions that were not played"]
    pub fn SCIPsetBetaExp3(exp3: *mut SCIP_BANDIT, beta: f64);
}
unsafe extern "C" {
    #[doc = " returns probability to play an action"]
    pub fn SCIPgetProbabilityExp3(exp3: *mut SCIP_BANDIT, action: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    #[doc = " creates and resets an Exp.3-IX bandit algorithm using \\p scip pointer"]
    pub fn SCIPcreateBanditExp3IX(
        scip: *mut SCIP,
        exp3ix: *mut *mut SCIP_BANDIT,
        priorities: *mut f64,
        nactions: ::std::os::raw::c_int,
        initseed: ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
unsafe extern "C" {
    #[doc = " returns probability to play an action"]
    pub fn SCIPgetProbabilityExp3IX(exp3ix: *mut SCIP_BANDIT, action: ::std::os::raw::c_int)
    -> f64;
}
unsafe extern "C" {
    #[doc = " create and reset UCB bandit algorithm"]
    pub fn SCIPcreateBanditUcb(
        scip: *mut SCIP,
        ucb: *mut *mut SCIP_BANDIT,
        priorities: *mut f64,
        alpha: f64,
        nactions: ::std::os::raw::c_int,
        initseed: ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
unsafe extern "C" {
    #[doc = " returns the upper confidence bound of a selected action"]
    pub fn SCIPgetConfidenceBoundUcb(ucb: *mut SCIP_BANDIT, action: ::std::os::raw::c_int) -> f64;
}
unsafe extern "C" {
    #[doc = " return start permutation of the UCB bandit algorithm"]
    pub fn SCIPgetStartPermutationUcb(ucb: *mut SCIP_BANDIT) -> *mut ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " select the next action"]
    pub fn SCIPbanditSelect(
        bandit: *mut SCIP_BANDIT,
        action: *mut ::std::os::raw::c_int,
    ) -> SCIP_RETCODE;
}
unsafe extern "C" {
    #[doc = " update the score of the selected action"]
    pub fn SCIPbanditUpdate(
        bandit: *mut SCIP_BANDIT,
        action: ::std::os::raw::c_int,
        score: f64,
    ) -> SCIP_RETCODE;
}
unsafe extern "C" {
    #[doc = " return the name of this bandit virtual function table"]
    pub fn SCIPbanditvtableGetName(
        banditvtable: *mut SCIP_BANDITVTABLE,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " return the random number generator of a bandit algorithm"]
    pub fn SCIPbanditGetRandnumgen(bandit: *mut SCIP_BANDIT) -> *mut SCIP_RANDNUMGEN;
}
unsafe extern "C" {
    #[doc = " return number of actions of this bandit algorithm"]
    pub fn SCIPbanditGetNActions(bandit: *mut SCIP_BANDIT) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " compares two benderss w. r. to their priority"]
    pub fn SCIPbendersComp(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " comparison method for sorting benderss w.r.t. to their name"]
    pub fn SCIPbendersCompName(
        elem1: *mut ::std::os::raw::c_void,
        elem2: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " gets user data of Benders' decomposition"]
    pub fn SCIPbendersGetData(benders: *mut SCIP_BENDERS) -> *mut SCIP_BENDERSDATA;
}
unsafe extern "C" {
    #[doc = " sets user data of Benders' decomposition; user has to free old data in advance!"]
    pub fn SCIPbendersSetData(benders: *mut SCIP_BENDERS, bendersdata: *mut SCIP_BENDERSDATA);
}
unsafe extern "C" {
    #[doc = " gets name of Benders' decomposition"]
    pub fn SCIPbendersGetName(benders: *mut SCIP_BENDERS) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " gets description of Benders' decomposition"]
    pub fn SCIPbendersGetDesc(benders: *mut SCIP_BENDERS) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[doc = " gets priority of Benders' decomposition"]
    pub fn SCIPbendersGetPriority(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " gets the number of subproblems for the Benders' decomposition"]
    pub fn SCIPbendersGetNSubproblems(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " returns the SCIP instance for a given subproblem"]
    pub fn SCIPbendersSubproblem(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> *mut SCIP;
}
unsafe extern "C" {
    #[doc = " gets the number of times, the Bender' decomposition was called and tried to find a violated second stage constraint"]
    pub fn SCIPbendersGetNCalls(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " gets the number of optimality cuts found by the collection of Benders' decomposition subproblems"]
    pub fn SCIPbendersGetNCutsFound(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " gets the number of cuts found from the strengthening round"]
    pub fn SCIPbendersGetNStrengthenCutsFound(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " gets the number of calls to the strengthening round"]
    pub fn SCIPbendersGetNStrengthenCalls(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " gets the number of calls to the strengthening round that fail"]
    pub fn SCIPbendersGetNStrengthenFails(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " gets time in seconds used in this Benders' decomposition for setting up for next stages"]
    pub fn SCIPbendersGetSetupTime(benders: *mut SCIP_BENDERS) -> f64;
}
unsafe extern "C" {
    #[doc = " gets execution time in seconds used in this Benders' decomposition"]
    pub fn SCIPbendersGetTime(benders: *mut SCIP_BENDERS) -> f64;
}
unsafe extern "C" {
    #[doc = " Is Benders' decomposition initialized?"]
    pub fn SCIPbendersIsInitialized(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " returns whether the given Benders' decomposition is in use in the current problem"]
    pub fn SCIPbendersIsActive(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " Returns whether only the convex relaxations will be checked in this solve loop\n  when Benders' is used in the LNS heuristics, only the convex relaxations of the master/subproblems are checked,\n  i.e. no integer cuts are generated. In this case, then Benders' decomposition is performed under the assumption\n  that all subproblems are convex relaxations."]
    pub fn SCIPbendersOnlyCheckConvexRelax(
        benders: *mut SCIP_BENDERS,
        subscipsoff: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " returns NLP solver parameters used for solving NLP subproblems"]
    pub fn SCIPbendersGetNLPParam(benders: *mut SCIP_BENDERS) -> SCIP_NLPPARAM;
}
unsafe extern "C" {
    #[doc = " Are Benders' cuts generated from the LP solutions?"]
    pub fn SCIPbendersCutLP(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " Are Benders' cuts generated from the pseudo solutions?"]
    pub fn SCIPbendersCutPseudo(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " Are Benders' cuts generated from the relaxation solutions?"]
    pub fn SCIPbendersCutRelaxation(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " Should this Benders' use the auxiliary variables from the highest priority Benders'?"]
    pub fn SCIPbendersShareAuxVars(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " sets the subproblem setup flag"]
    pub fn SCIPbendersSetSubproblemIsSetup(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        issetup: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    #[doc = " returns the subproblem setup flag"]
    pub fn SCIPbendersSubproblemIsSetup(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " returns the master auxiliary variable that represents an underestimation of the subproblem objective value."]
    pub fn SCIPbenderGetMasterAuxiliaryVar(benders: *mut SCIP_BENDERS) -> *mut SCIP_VAR;
}
unsafe extern "C" {
    #[doc = " returns the auxiliary variable for the given subproblem"]
    pub fn SCIPbendersGetAuxiliaryVar(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> *mut SCIP_VAR;
}
unsafe extern "C" {
    #[doc = " returns all auxiliary variables"]
    pub fn SCIPbendersGetAuxiliaryVars(benders: *mut SCIP_BENDERS) -> *mut *mut SCIP_VAR;
}
unsafe extern "C" {
    #[doc = " returns the subproblem master variables for the given subproblem"]
    pub fn SCIPbendersGetSubproblemMasterVars(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> *mut *mut SCIP_VAR;
}
unsafe extern "C" {
    #[doc = " returns the number of subproblem master variables for the given subproblem"]
    pub fn SCIPbendersGetNSubproblemMasterVars(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " returns the subproblem master variable data for the given subproblem"]
    pub fn SCIPbendersGetSubproblemMasterVarsData(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        vars: *mut *mut *mut SCIP_VAR,
        nvars: *mut ::std::os::raw::c_int,
        nbinvars: *mut ::std::os::raw::c_int,
        nintvars: *mut ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    #[doc = " stores the objective function value of the subproblem for use in cut generation"]
    pub fn SCIPbendersSetSubproblemObjval(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        objval: f64,
    );
}
unsafe extern "C" {
    #[doc = " returns the objective function value of the subproblem for use in cut generation"]
    pub fn SCIPbendersGetSubproblemObjval(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> f64;
}
unsafe extern "C" {
    #[doc = " returns the number of cuts that have been added for storage"]
    pub fn SCIPbendersGetNStoredCuts(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " returns the data for the cuts that have been added by the Benders' cut plugin"]
    pub fn SCIPbendersGetStoredCutData(
        benders: *mut SCIP_BENDERS,
        cutidx: ::std::os::raw::c_int,
        vars: *mut *mut *mut SCIP_VAR,
        vals: *mut *mut f64,
        lhs: *mut f64,
        rhs: *mut f64,
        nvars: *mut ::std::os::raw::c_int,
    ) -> SCIP_RETCODE;
}
unsafe extern "C" {
    #[doc = " returns the original problem data for the cuts that have been added by the Benders' cut plugin. The stored\n  variables and values will populate the input vars and vals arrays. Thus, memory must be allocated for the vars and\n  vals arrays"]
    pub fn SCIPbendersGetStoredCutOrigData(
        benders: *mut SCIP_BENDERS,
        cutidx: ::std::os::raw::c_int,
        vars: *mut *mut *mut SCIP_VAR,
        vals: *mut *mut f64,
        lhs: *mut f64,
        rhs: *mut f64,
        nvars: *mut ::std::os::raw::c_int,
        varssize: ::std::os::raw::c_int,
    ) -> SCIP_RETCODE;
}
unsafe extern "C" {
    #[doc = " returns the Benders' cut of the given name, or NULL if not existing"]
    pub fn SCIPfindBenderscut(
        benders: *mut SCIP_BENDERS,
        name: *const ::std::os::raw::c_char,
    ) -> *mut SCIP_BENDERSCUT;
}
unsafe extern "C" {
    #[doc = " returns the array of currently available Benders' cuts; active Benders' decomposition are in the first slots of\n the array"]
    pub fn SCIPbendersGetBenderscuts(benders: *mut SCIP_BENDERS) -> *mut *mut SCIP_BENDERSCUT;
}
unsafe extern "C" {
    #[doc = " returns the number of currently available Benders' cuts"]
    pub fn SCIPbendersGetNBenderscuts(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " sets the priority of a Benders' decomposition"]
    pub fn SCIPbendersSetBenderscutPriority(
        benders: *mut SCIP_BENDERS,
        benderscut: *mut SCIP_BENDERSCUT,
        priority: ::std::os::raw::c_int,
    ) -> SCIP_RETCODE;
}
unsafe extern "C" {
    #[doc = " returns whether the solution has non-zero slack variables"]
    pub fn SCIPbendersSolSlackVarsActive(
        benders: *mut SCIP_BENDERS,
        activeslack: *mut ::std::os::raw::c_uint,
    ) -> SCIP_RETCODE;
}
unsafe extern "C" {
    #[doc = " sets the subproblem type\n\n The subproblem types are:\n    - Convex constraints with continuous variables\n    - Convex constraints with discrete variables\n    - Non-convex constraints with continuous variables\n    - Non-convex constraints with discrete variables"]
    pub fn SCIPbendersSetSubproblemType(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        subprobtype: SCIP_BENDERSSUBTYPE,
    );
}
unsafe extern "C" {
    #[doc = " returns the type of the subproblem\n\n  This type is used to determine whether the duals of the problem can be used to generate cuts"]
    pub fn SCIPbendersGetSubproblemType(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> SCIP_BENDERSSUBTYPE;
}
unsafe extern "C" {
    #[doc = " sets the flag indicating whether a subproblem is convex\n\n  It is possible that this can change during the solving process. One example is when the three-phase method is\n  employed, where the first phase solves the convex relaxation of both the master and subproblems, the second phase\n  reintroduces the integrality constraints to the master problem and the third phase then reintroduces integrality\n  constraints to the subproblems."]
    pub fn SCIPbendersSetSubproblemIsConvex(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        isconvex: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    #[doc = " returns whether the subproblem is convex\n\n  This means that the dual solution can be used to generate cuts."]
    pub fn SCIPbendersSubproblemIsConvex(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " returns the number of subproblems that are convex"]
    pub fn SCIPbendersGetNConvexSubproblems(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " sets the flag indicating whether a subproblem contains non-linear constraints"]
    pub fn SCIPbendersSetSubproblemIsNonlinear(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
        isnonlinear: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    #[doc = " returns whether the subproblem contains non-linear constraints."]
    pub fn SCIPbendersSubproblemIsNonlinear(
        benders: *mut SCIP_BENDERS,
        probnumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " returns the number of subproblems that contain non-linear constraints"]
    pub fn SCIPbendersGetNNonlinearSubproblems(benders: *mut SCIP_BENDERS)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    #[doc = " sets the flag indicating whether the master problem contains non-linear constraints"]
    pub fn SCIPbendersSetMasterIsNonlinear(
        benders: *mut SCIP_BENDERS,
        isnonlinear: ::std::os::raw::c_uint,
    );
}
unsafe extern "C" {
    #[doc = " returns whether the master problem contains non-linear constraints."]
    pub fn SCIPbendersMasterIsNonlinear(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " returns the objective type for the aggregation of the Benders' decomposition subproblem objectives"]
    pub fn SCIPbendersGetObjectiveType(benders: *mut SCIP_BENDERS) -> SCIP_BENDERSOBJTYPE;
}
unsafe extern "C" {
    #[doc = " returns the flag indicating that Benders' decomposition is in a cut strengthening round"]
    pub fn SCIPbendersInStrengthenRound(benders: *mut SCIP_BENDERS) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    #[doc = " returns whether at least one of the subproblems has been identified as infeasible.\n  NOTE: this is without any variable fixing being performed"]
    pub fn SCIPbendersSubproblemsAreInfeasible(
        benders: *mut SCIP_BENDERS,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
